sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_i2c.c
        /* Check if the I2C is already enabled */
        if ((hi2c->Instance->CR1 & I2C_CR1_PE) != I2C_CR1_PE)
        {
            /* Enable I2C peripheral */
            __HAL_I2C_ENABLE(hi2c);
        }

        /* Disable Pos */
        CLEAR_BIT(hi2c->Instance->CR1, I2C_CR1_POS);

        hi2c->State     = HAL_I2C_STATE_BUSY_RX;
        hi2c->Mode      = HAL_I2C_MODE_SLAVE;
        hi2c->ErrorCode = HAL_I2C_ERROR_NONE;

        /* Prepare transfer parameters */
        hi2c->pBuffPtr    = pData;
        hi2c->XferCount   = Size;
        hi2c->XferSize    = hi2c->XferCount;
        hi2c->XferOptions = I2C_NO_OPTION_FRAME;

        /* Enable Address Acknowledge */
        SET_BIT(hi2c->Instance->CR1, I2C_CR1_ACK);

        /* Process Unlocked */
        __HAL_UNLOCK(hi2c);

        /* Note : The I2C interrupts must be enabled after unlocking current process
                  to avoid the risk of I2C interrupt handle execution before current
                  process unlock */

        /* Enable EVT, BUF and ERR interrupt */
        __HAL_I2C_ENABLE_IT(hi2c, I2C_IT_EVT | I2C_IT_BUF | I2C_IT_ERR);

        return HAL_OK;
    }
    else
    {
        return HAL_BUSY;
    }
}

/**
  * @brief  Transmit in master mode an amount of data in non-blocking mode with DMA
  * @param  hi2c Pointer to a I2C_HandleTypeDef structure that contains
  *                the configuration information for the specified I2C.
  * @param  DevAddress Target device address: The device 7 bits address value
  *         in datasheet must be shifted to the left before calling the interface
  * @param  pData Pointer to data buffer
  * @param  Size Amount of data to be sent
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_I2C_Master_Transmit_DMA(I2C_HandleTypeDef *hi2c, uint16_t DevAddress, uint8_t *pData, uint16_t Size)
{
    /* Init tickstart for timeout management*/
    uint32_t tickstart = HAL_GetTick();
    __IO uint32_t count = 0U;
    HAL_StatusTypeDef dmaxferstatus;

    if (hi2c->State == HAL_I2C_STATE_READY)
    {
        /* Wait until BUSY flag is reset */
        count = I2C_TIMEOUT_BUSY_FLAG * (SystemCoreClock / 25U / 1000U);
        do
        {
            count--;
            if (count == 0U)
            {
                hi2c->PreviousState       = I2C_STATE_NONE;
                hi2c->State               = HAL_I2C_STATE_READY;
                hi2c->Mode                = HAL_I2C_MODE_NONE;
                hi2c->ErrorCode           |= HAL_I2C_ERROR_TIMEOUT;

                /* Process Unlocked */
                __HAL_UNLOCK(hi2c);

                return HAL_ERROR;
            }
        }
        while (__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_BUSY) != RESET);

        /* Process Locked */
        __HAL_LOCK(hi2c);

        /* Check if the I2C is already enabled */
        if ((hi2c->Instance->CR1 & I2C_CR1_PE) != I2C_CR1_PE)
        {
            /* Enable I2C peripheral */
            __HAL_I2C_ENABLE(hi2c);
        }

        /* Disable Pos */
        CLEAR_BIT(hi2c->Instance->CR1, I2C_CR1_POS);

        hi2c->State     = HAL_I2C_STATE_BUSY_TX;
        hi2c->Mode      = HAL_I2C_MODE_MASTER;
        hi2c->ErrorCode = HAL_I2C_ERROR_NONE;

        /* Prepare transfer parameters */
        hi2c->pBuffPtr    = pData;
        hi2c->XferCount   = Size;
        hi2c->XferSize    = hi2c->XferCount;
        hi2c->XferOptions = I2C_NO_OPTION_FRAME;
        hi2c->Devaddress  = DevAddress;

        if (hi2c->XferSize > 0U)
        {
            /* Set the I2C DMA transfer complete callback */
            hi2c->hdmatx->XferCpltCallback = I2C_DMAXferCplt;

            /* Set the DMA error callback */
            hi2c->hdmatx->XferErrorCallback = I2C_DMAError;

            /* Set the unused DMA callbacks to NULL */
            hi2c->hdmatx->XferHalfCpltCallback = NULL;
            hi2c->hdmatx->XferAbortCallback = NULL;

            /* Enable the DMA channel */
            dmaxferstatus = HAL_DMA_Start_IT(hi2c->hdmatx, (uint32_t)hi2c->pBuffPtr, (uint32_t)&hi2c->Instance->DR, hi2c->XferSize);

            if (dmaxferstatus == HAL_OK)
            {
                /* Enable Acknowledge */
                SET_BIT(hi2c->Instance->CR1, I2C_CR1_ACK);

                /* Generate Start */
                SET_BIT(hi2c->Instance->CR1, I2C_CR1_START);

                if(I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_SB, RESET,I2C_TIMEOUT_FLAG,tickstart) != HAL_OK)
                {
                    return HAL_TIMEOUT;
                }
                hi2c->Instance->DR = I2C_7BIT_ADD_WRITE(DevAddress);

                /* Wait until ADDR flag is set */
                if (I2C_WaitOnMasterAddressFlagUntilTimeout(hi2c, I2C_FLAG_ADDR,I2C_TIMEOUT_FLAG, tickstart) != HAL_OK)
                {
                    return HAL_ERROR;
                }
                /* Process Unlocked */
                __HAL_UNLOCK(hi2c);

                /* Note : The I2C interrupts must be enabled after unlocking current process
                to avoid the risk of I2C interrupt handle execution before current
                process unlock */

                /* Enable EVT and ERR interrupt */
                __HAL_I2C_ENABLE_IT(hi2c, I2C_IT_EVT | I2C_IT_ERR);



                /* Enable DMA Request */
                SET_BIT(hi2c->Instance->CR2, I2C_CR2_DMAEN);
            }
            else
            {
                /* Update I2C state */
                hi2c->State     = HAL_I2C_STATE_READY;
                hi2c->Mode      = HAL_I2C_MODE_NONE;

                /* Update I2C error code */
                hi2c->ErrorCode |= HAL_I2C_ERROR_DMA;

                /* Process Unlocked */
                __HAL_UNLOCK(hi2c);

                return HAL_ERROR;
            }
        }
        else
        {
            /* Enable Acknowledge */
            SET_BIT(hi2c->Instance->CR1, I2C_CR1_ACK);

            /* Generate Start */
            SET_BIT(hi2c->Instance->CR1, I2C_CR1_START);

            /* Process Unlocked */
            __HAL_UNLOCK(hi2c);

            /* Note : The I2C interrupts must be enabled after unlocking current process
            to avoid the risk of I2C interrupt handle execution before current
            process unlock */

