sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_i2c.c
                    /* Increment Buffer pointer */
                    hi2c->pBuffPtr++;

                    /* Update counter */
                    hi2c->XferSize--;
                    hi2c->XferCount--;
                }
                /* Two bytes */
                else if (hi2c->XferSize == 2U)
                {
                    /* Wait until BTF flag is set */
                    if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_BTF, RESET, Timeout, tickstart) != HAL_OK)
                    {
                        return HAL_ERROR;
                    }

                    /* Disable all active IRQs around ADDR clearing and STOP programming because the EV6_3
                       software sequence must complete before the current byte end of transfer */
                    __disable_irq();

                    /* Generate Stop */
                    SET_BIT(hi2c->Instance->CR1, I2C_CR1_STOP);

                    /* Read data from DR */
                    *hi2c->pBuffPtr = (uint8_t)hi2c->Instance->DR;

                    /* Increment Buffer pointer */
                    hi2c->pBuffPtr++;

                    /* Update counter */
                    hi2c->XferSize--;
                    hi2c->XferCount--;

                    /* Re-enable IRQs */
                    __enable_irq();

                    /* Read data from DR */
                    *hi2c->pBuffPtr = (uint8_t)hi2c->Instance->DR;

                    /* Increment Buffer pointer */
                    hi2c->pBuffPtr++;

                    /* Update counter */
                    hi2c->XferSize--;
                    hi2c->XferCount--;
                }
                /* 3 Last bytes */
                else
                {
                    /* Wait until BTF flag is set */
                    if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_BTF, RESET, Timeout, tickstart) != HAL_OK)
                    {
                        return HAL_ERROR;
                    }

                    /* Disable Acknowledge */
                    CLEAR_BIT(hi2c->Instance->CR1, I2C_CR1_ACK);

                    /* Disable all active IRQs around ADDR clearing and STOP programming because the EV6_3
                       software sequence must complete before the current byte end of transfer */
                    __disable_irq();

                    /* Read data from DR */
                    *hi2c->pBuffPtr = (uint8_t)hi2c->Instance->DR;

                    /* Increment Buffer pointer */
                    hi2c->pBuffPtr++;

                    /* Update counter */
                    hi2c->XferSize--;
                    hi2c->XferCount--;

                    /* Wait until BTF flag is set */
                    if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_BTF, RESET, Timeout, tickstart) != HAL_OK)
                    {
                        return HAL_ERROR;
                    }

                    /* Generate Stop */
                    SET_BIT(hi2c->Instance->CR1, I2C_CR1_STOP);

                    /* Read data from DR */
                    *hi2c->pBuffPtr = (uint8_t)hi2c->Instance->DR;

                    /* Increment Buffer pointer */
                    hi2c->pBuffPtr++;

                    /* Update counter */
                    hi2c->XferSize--;
                    hi2c->XferCount--;

                    /* Re-enable IRQs */
                    __enable_irq();

                    /* Read data from DR */
                    *hi2c->pBuffPtr = (uint8_t)hi2c->Instance->DR;

                    /* Increment Buffer pointer */
                    hi2c->pBuffPtr++;

                    /* Update counter */
                    hi2c->XferSize--;
                    hi2c->XferCount--;
                }
            }
            else
            {
                /* Wait until RXNE flag is set */
                if (I2C_WaitOnRXNEFlagUntilTimeout(hi2c, Timeout, tickstart) != HAL_OK)
                {
                    return HAL_ERROR;
                }

                /* Read data from DR */
                *hi2c->pBuffPtr = (uint8_t)hi2c->Instance->DR;

                /* Increment Buffer pointer */
                hi2c->pBuffPtr++;

                /* Update counter */
                hi2c->XferSize--;
                hi2c->XferCount--;

                if (__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_BTF) == SET)
                {
                    /* Read data from DR */
                    *hi2c->pBuffPtr = (uint8_t)hi2c->Instance->DR;

                    /* Increment Buffer pointer */
                    hi2c->pBuffPtr++;

                    /* Update counter */
                    hi2c->XferSize--;
                    hi2c->XferCount--;
                }
            }
        }

        hi2c->State = HAL_I2C_STATE_READY;
        hi2c->Mode = HAL_I2C_MODE_NONE;

        /* Process Unlocked */
        __HAL_UNLOCK(hi2c);

        return HAL_OK;
    }
    else
    {
        return HAL_BUSY;
    }
}

/**
  * @brief  Write an amount of data in non-blocking mode with Interrupt to a specific memory address
  * @param  hi2c Pointer to a I2C_HandleTypeDef structure that contains
  *                the configuration information for the specified I2C.
  * @param  DevAddress Target device address: The device 7 bits address value
  *         in datasheet must be shifted to the left before calling the interface
  * @param  MemAddress Internal memory address
  * @param  MemAddSize Size of internal memory address
  * @param  pData Pointer to data buffer
  * @param  Size Amount of data to be sent
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_I2C_Mem_Write_IT(I2C_HandleTypeDef *hi2c, uint16_t DevAddress, uint16_t MemAddress, uint16_t MemAddSize, uint8_t *pData, uint16_t Size)
{
    __IO uint32_t count = 0U;

    /* Check the parameters */
    assert_param(IS_I2C_MEMADD_SIZE(MemAddSize));

    if (hi2c->State == HAL_I2C_STATE_READY)
    {
        /* Wait until BUSY flag is reset */
        count = I2C_TIMEOUT_BUSY_FLAG * (SystemCoreClock / 25U / 1000U);
        do
        {
            count--;
            if (count == 0U)
            {
                hi2c->PreviousState       = I2C_STATE_NONE;
                hi2c->State               = HAL_I2C_STATE_READY;
                hi2c->Mode                = HAL_I2C_MODE_NONE;
                hi2c->ErrorCode           |= HAL_I2C_ERROR_TIMEOUT;

                /* Process Unlocked */
                __HAL_UNLOCK(hi2c);

                return HAL_ERROR;
            }
        }
        while (__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_BUSY) != RESET);

        /* Process Locked */
        __HAL_LOCK(hi2c);

