sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_i2c.c
                /* Clear ADDR flag */
                __HAL_I2C_CLEAR_ADDRFLAG(hi2c);

                /* Process Unlocked */
                __HAL_UNLOCK(hi2c);

                /* Note : The I2C interrupts must be enabled after unlocking current process
                to avoid the risk of I2C interrupt handle execution before current
                process unlock */
                /* Enable ERR interrupt */
                __HAL_I2C_ENABLE_IT(hi2c, I2C_IT_ERR);

                /* Enable DMA Request */
                hi2c->Instance->CR2 |= I2C_CR2_DMAEN;
            }
            else
            {
                /* Update I2C state */
                hi2c->State     = HAL_I2C_STATE_READY;
                hi2c->Mode      = HAL_I2C_MODE_NONE;

                /* Update I2C error code */
                hi2c->ErrorCode |= HAL_I2C_ERROR_DMA;

                /* Process Unlocked */
                __HAL_UNLOCK(hi2c);

                return HAL_ERROR;
            }
        }
        else
        {
            /* Send Slave Address and Memory Address */
            if (I2C_RequestMemoryRead(hi2c, DevAddress, MemAddress, MemAddSize, I2C_TIMEOUT_FLAG, tickstart) != HAL_OK)
            {
                return HAL_ERROR;
            }

            /* Clear ADDR flag */
            __HAL_I2C_CLEAR_ADDRFLAG(hi2c);

            /* Generate Stop */
            SET_BIT(hi2c->Instance->CR1, I2C_CR1_STOP);

            hi2c->State = HAL_I2C_STATE_READY;

            /* Process Unlocked */
            __HAL_UNLOCK(hi2c);
        }

        return HAL_OK;
    }
    else
    {
        return HAL_BUSY;
    }
}

/**
  * @brief  Checks if target device is ready for communication.
  * @note   This function is used with Memory devices
  * @param  hi2c Pointer to a I2C_HandleTypeDef structure that contains
  *                the configuration information for the specified I2C.
  * @param  DevAddress Target device address: The device 7 bits address value
  *         in datasheet must be shifted to the left before calling the interface
  * @param  Trials Number of trials
  * @param  Timeout Timeout duration
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_I2C_IsDeviceReady(I2C_HandleTypeDef *hi2c, uint16_t DevAddress, uint32_t Trials, uint32_t Timeout)
{
    /* Get tick */
    uint32_t tickstart = HAL_GetTick();
    uint32_t I2C_Trials = 1U;
    FlagStatus tmp1;
    FlagStatus tmp2;

    if (hi2c->State == HAL_I2C_STATE_READY)
    {
        /* Wait until BUSY flag is reset */
        if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_BUSY, SET, I2C_TIMEOUT_BUSY_FLAG, tickstart) != HAL_OK)
        {
            return HAL_BUSY;
        }

        /* Process Locked */
        __HAL_LOCK(hi2c);

        /* Check if the I2C is already enabled */
        if ((hi2c->Instance->CR1 & I2C_CR1_PE) != I2C_CR1_PE)
        {
            /* Enable I2C peripheral */
            __HAL_I2C_ENABLE(hi2c);
        }

        /* Disable Pos */
        CLEAR_BIT(hi2c->Instance->CR1, I2C_CR1_POS);

        hi2c->State = HAL_I2C_STATE_BUSY;
        hi2c->ErrorCode = HAL_I2C_ERROR_NONE;
        hi2c->XferOptions = I2C_NO_OPTION_FRAME;

        do
        {
            /* Generate Start */
            SET_BIT(hi2c->Instance->CR1, I2C_CR1_START);

            /* Wait until SB flag is set */
            if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_SB, RESET, Timeout, tickstart) != HAL_OK)
            {
                return HAL_ERROR;
            }

            /* Send slave address */
            hi2c->Instance->DR = I2C_7BIT_ADD_WRITE(DevAddress);

            /* Wait until ADDR or AF flag are set */
            /* Get tick */
            tickstart = HAL_GetTick();

            tmp1 = __HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_ADDR);
            tmp2 = __HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_AF);
            while ((hi2c->State != HAL_I2C_STATE_TIMEOUT) && (tmp1 == RESET) && (tmp2 == RESET))
            {
                if (((HAL_GetTick() - tickstart) > Timeout) || (Timeout == 0U))
                {
                    hi2c->State = HAL_I2C_STATE_TIMEOUT;
                }
                tmp1 = __HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_ADDR);
                tmp2 = __HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_AF);
            }

            hi2c->State = HAL_I2C_STATE_READY;

            /* Check if the ADDR flag has been set */
            if (__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_ADDR) == SET)
            {
                /* Generate Stop */
                SET_BIT(hi2c->Instance->CR1, I2C_CR1_STOP);

                /* Clear ADDR Flag */
                __HAL_I2C_CLEAR_ADDRFLAG(hi2c);

                /* Wait until BUSY flag is reset */
                if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_BUSY, SET, I2C_TIMEOUT_BUSY_FLAG, tickstart) != HAL_OK)
                {
                    return HAL_ERROR;
                }

                hi2c->State = HAL_I2C_STATE_READY;

                /* Process Unlocked */
                __HAL_UNLOCK(hi2c);

                return HAL_OK;
            }
            else
            {
                /* Generate Stop */
                SET_BIT(hi2c->Instance->CR1, I2C_CR1_STOP);

                /* Clear AF Flag */
                __HAL_I2C_CLEAR_FLAG(hi2c, I2C_FLAG_AF);

                /* Wait until BUSY flag is reset */
                if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_BUSY, SET, I2C_TIMEOUT_BUSY_FLAG, tickstart) != HAL_OK)
                {
                    return HAL_ERROR;
                }
            }

            /* Increment Trials */
            I2C_Trials++;
        }
        while (I2C_Trials < Trials);

        hi2c->State = HAL_I2C_STATE_READY;

        /* Process Unlocked */
        __HAL_UNLOCK(hi2c);

        return HAL_ERROR;
    }
    else
    {
        return HAL_BUSY;
    }
}

/**
  * @brief  Sequential transmit in master I2C mode an amount of data in non-blocking mode with Interrupt.
  * @note   This interface allow to manage repeated start condition when a direction change during transfer
  * @param  hi2c Pointer to a I2C_HandleTypeDef structure that contains
  *         the configuration information for the specified I2C.
  * @param  DevAddress Target device address: The device 7 bits address value
  *         in datasheet must be shifted to the left before calling the interface
  * @param  pData Pointer to data buffer
  * @param  Size Amount of data to be sent
  * @param  XferOptions Options of Transfer, value of @ref I2C_XferOptions_definition
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_I2C_Master_Seq_Transmit_IT(I2C_HandleTypeDef *hi2c, uint16_t DevAddress, uint8_t *pData, uint16_t Size, uint32_t XferOptions)
{
    __IO uint32_t Prev_State = 0x00U;
    __IO uint32_t count      = 0x00U;

    /* Check the parameters */
    assert_param(IS_I2C_TRANSFER_OPTIONS_REQUEST(XferOptions));

    if (hi2c->State == HAL_I2C_STATE_READY)
    {
        /* Check Busy Flag only if FIRST call of Master interface */
        if ((XferOptions == I2C_FIRST_AND_LAST_FRAME) || (XferOptions == I2C_FIRST_FRAME))
        {
            /* Wait until BUSY flag is reset */
            count = I2C_TIMEOUT_BUSY_FLAG * (SystemCoreClock / 25U / 1000U);
            do
            {
                count--;
                if (count == 0U)
                {
                    hi2c->PreviousState       = I2C_STATE_NONE;
                    hi2c->State               = HAL_I2C_STATE_READY;
                    hi2c->Mode                = HAL_I2C_MODE_NONE;
                    hi2c->ErrorCode           |= HAL_I2C_ERROR_TIMEOUT;

                    /* Process Unlocked */
                    __HAL_UNLOCK(hi2c);

                    return HAL_ERROR;
                }
            }
            while (__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_BUSY) != RESET);
        }

        /* Process Locked */
        __HAL_LOCK(hi2c);

