sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_i2c.c
                /* Update I2C error code */
                hi2c->ErrorCode |= HAL_I2C_ERROR_DMA;

                /* Process Unlocked */
                __HAL_UNLOCK(hi2c);

                return HAL_ERROR;
            }
        }
        else
        {
            /* Enable Acknowledge */
            SET_BIT(hi2c->Instance->CR1, I2C_CR1_ACK);

            /* If transfer direction not change and there is no request to start another frame, do not generate Restart Condition */
            /* Mean Previous state is same as current state */
            if ((Prev_State != I2C_STATE_MASTER_BUSY_TX) || (IS_I2C_TRANSFER_OTHER_OPTIONS_REQUEST(XferOptions) == 1))
            {
                /* Generate Start */
                SET_BIT(hi2c->Instance->CR1, I2C_CR1_START);
            }

            /* Process Unlocked */
            __HAL_UNLOCK(hi2c);

            /* Note : The I2C interrupts must be enabled after unlocking current process
            to avoid the risk of I2C interrupt handle execution before current
            process unlock */

            /* Enable EVT, BUF and ERR interrupt */
            __HAL_I2C_ENABLE_IT(hi2c, I2C_IT_EVT | I2C_IT_BUF | I2C_IT_ERR);
        }

        return HAL_OK;
    }
    else
    {
        return HAL_BUSY;
    }
}

/**
  * @brief  Sequential receive in master I2C mode an amount of data in non-blocking mode with Interrupt
  * @note   This interface allow to manage repeated start condition when a direction change during transfer
  * @param  hi2c Pointer to a I2C_HandleTypeDef structure that contains
  *         the configuration information for the specified I2C.
  * @param  DevAddress Target device address: The device 7 bits address value
  *         in datasheet must be shifted to the left before calling the interface
  * @param  pData Pointer to data buffer
  * @param  Size Amount of data to be sent
  * @param  XferOptions Options of Transfer, value of @ref I2C_XferOptions_definition
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_I2C_Master_Seq_Receive_IT(I2C_HandleTypeDef *hi2c, uint16_t DevAddress, uint8_t *pData, uint16_t Size, uint32_t XferOptions)
{
    __IO uint32_t Prev_State = 0x00U;
    __IO uint32_t count = 0U;
    uint32_t enableIT = (I2C_IT_EVT | I2C_IT_BUF | I2C_IT_ERR);

    /* Check the parameters */
    assert_param(IS_I2C_TRANSFER_OPTIONS_REQUEST(XferOptions));

    if (hi2c->State == HAL_I2C_STATE_READY)
    {
        /* Check Busy Flag only if FIRST call of Master interface */
        if ((XferOptions == I2C_FIRST_AND_LAST_FRAME) || (XferOptions == I2C_FIRST_FRAME))
        {
            /* Wait until BUSY flag is reset */
            count = I2C_TIMEOUT_BUSY_FLAG * (SystemCoreClock / 25U / 1000U);
            do
            {
                count--;
                if (count == 0U)
                {
                    hi2c->PreviousState       = I2C_STATE_NONE;
                    hi2c->State               = HAL_I2C_STATE_READY;
                    hi2c->Mode                = HAL_I2C_MODE_NONE;
                    hi2c->ErrorCode           |= HAL_I2C_ERROR_TIMEOUT;

                    /* Process Unlocked */
                    __HAL_UNLOCK(hi2c);

                    return HAL_ERROR;
                }
            }
            while (__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_BUSY) != RESET);
        }

        /* Process Locked */
        __HAL_LOCK(hi2c);

        /* Check if the I2C is already enabled */
        if ((hi2c->Instance->CR1 & I2C_CR1_PE) != I2C_CR1_PE)
        {
            /* Enable I2C peripheral */
            __HAL_I2C_ENABLE(hi2c);
        }

        /* Disable Pos */
        CLEAR_BIT(hi2c->Instance->CR1, I2C_CR1_POS);

        hi2c->State     = HAL_I2C_STATE_BUSY_RX;
        hi2c->Mode      = HAL_I2C_MODE_MASTER;
        hi2c->ErrorCode = HAL_I2C_ERROR_NONE;

        /* Prepare transfer parameters */
        hi2c->pBuffPtr    = pData;
        hi2c->XferCount   = Size;
        hi2c->XferSize    = hi2c->XferCount;
        hi2c->XferOptions = XferOptions;
        hi2c->Devaddress  = DevAddress;

        Prev_State = hi2c->PreviousState;

        if ((hi2c->XferCount == 2U) && ((XferOptions == I2C_LAST_FRAME) || (XferOptions == I2C_LAST_FRAME_NO_STOP)))
        {
            if (Prev_State == I2C_STATE_MASTER_BUSY_RX)
            {
                /* Disable Acknowledge */
                CLEAR_BIT(hi2c->Instance->CR1, I2C_CR1_ACK);

                /* Enable Pos */
                SET_BIT(hi2c->Instance->CR1, I2C_CR1_POS);

                /* Remove Enabling of IT_BUF, mean RXNE treatment, treat the 2 bytes through BTF */
                enableIT &= ~I2C_IT_BUF;
            }
            else
            {
                /* Enable Acknowledge */
                SET_BIT(hi2c->Instance->CR1, I2C_CR1_ACK);
            }
        }
        else
        {
            /* Enable Acknowledge */
            SET_BIT(hi2c->Instance->CR1, I2C_CR1_ACK);
        }

        /* If transfer direction not change and there is no request to start another frame, do not generate Restart Condition */
        /* Mean Previous state is same as current state */
        if ((Prev_State != I2C_STATE_MASTER_BUSY_RX) || (IS_I2C_TRANSFER_OTHER_OPTIONS_REQUEST(XferOptions) == 1))
        {
            /* Generate Start */
            SET_BIT(hi2c->Instance->CR1, I2C_CR1_START);
        }

        /* Process Unlocked */
        __HAL_UNLOCK(hi2c);

        /* Note : The I2C interrupts must be enabled after unlocking current process
        to avoid the risk of I2C interrupt handle execution before current
        process unlock */

        /* Enable interrupts */
        __HAL_I2C_ENABLE_IT(hi2c, enableIT);

        return HAL_OK;
    }
    else
    {
        return HAL_BUSY;
    }
}

/**
  * @brief  Sequential receive in master mode an amount of data in non-blocking mode with DMA
  * @note   This interface allow to manage repeated start condition when a direction change during transfer
  * @param  hi2c Pointer to a I2C_HandleTypeDef structure that contains
  *         the configuration information for the specified I2C.
  * @param  DevAddress Target device address: The device 7 bits address value
  *         in datasheet must be shifted to the left before calling the interface
  * @param  pData Pointer to data buffer
  * @param  Size Amount of data to be sent
  * @param  XferOptions Options of Transfer, value of @ref I2C_XferOptions_definition
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_I2C_Master_Seq_Receive_DMA(I2C_HandleTypeDef *hi2c, uint16_t DevAddress, uint8_t *pData, uint16_t Size, uint32_t XferOptions)
{
    __IO uint32_t Prev_State = 0x00U;
    __IO uint32_t count = 0U;
    uint32_t enableIT = (I2C_IT_EVT | I2C_IT_BUF | I2C_IT_ERR);
    HAL_StatusTypeDef dmaxferstatus;

    /* Check the parameters */
    assert_param(IS_I2C_TRANSFER_OPTIONS_REQUEST(XferOptions));

    if (hi2c->State == HAL_I2C_STATE_READY)
    {
        /* Check Busy Flag only if FIRST call of Master interface */
        if ((XferOptions == I2C_FIRST_AND_LAST_FRAME) || (XferOptions == I2C_FIRST_FRAME))
        {
            /* Wait until BUSY flag is reset */
            count = I2C_TIMEOUT_BUSY_FLAG * (SystemCoreClock / 25U / 1000U);
            do
            {
                count--;
                if (count == 0U)
                {
                    hi2c->PreviousState       = I2C_STATE_NONE;
                    hi2c->State               = HAL_I2C_STATE_READY;
                    hi2c->Mode                = HAL_I2C_MODE_NONE;
                    hi2c->ErrorCode           |= HAL_I2C_ERROR_TIMEOUT;

                    /* Process Unlocked */
                    __HAL_UNLOCK(hi2c);

                    return HAL_ERROR;
                }
            }
            while (__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_BUSY) != RESET);
        }

        /* Process Locked */
        __HAL_LOCK(hi2c);

