sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_i2c.c
        /* Check if the I2C is already enabled */
        if ((hi2c->Instance->CR1 & I2C_CR1_PE) != I2C_CR1_PE)
        {
            /* Enable I2C peripheral */
            __HAL_I2C_ENABLE(hi2c);
        }

        /* Disable Pos */
        CLEAR_BIT(hi2c->Instance->CR1, I2C_CR1_POS);

        /* Clear Last DMA bit */
        CLEAR_BIT(hi2c->Instance->CR2, I2C_CR2_LAST);

        hi2c->State     = HAL_I2C_STATE_BUSY_RX;
        hi2c->Mode      = HAL_I2C_MODE_MASTER;
        hi2c->ErrorCode = HAL_I2C_ERROR_NONE;

        /* Prepare transfer parameters */
        hi2c->pBuffPtr    = pData;
        hi2c->XferCount   = Size;
        hi2c->XferSize    = hi2c->XferCount;
        hi2c->XferOptions = XferOptions;
        hi2c->Devaddress  = DevAddress;

        Prev_State = hi2c->PreviousState;

        if (hi2c->XferSize > 0U)
        {
            if ((hi2c->XferCount == 2U) && ((XferOptions == I2C_LAST_FRAME) || (XferOptions == I2C_LAST_FRAME_NO_STOP)))
            {
                if (Prev_State == I2C_STATE_MASTER_BUSY_RX)
                {
                    /* Disable Acknowledge */
                    CLEAR_BIT(hi2c->Instance->CR1, I2C_CR1_ACK);

                    /* Enable Pos */
                    SET_BIT(hi2c->Instance->CR1, I2C_CR1_POS);

                    /* Enable Last DMA bit */
                    SET_BIT(hi2c->Instance->CR2, I2C_CR2_LAST);
                }
                else
                {
                    /* Enable Acknowledge */
                    SET_BIT(hi2c->Instance->CR1, I2C_CR1_ACK);
                }
            }
            else
            {
                /* Enable Acknowledge */
                SET_BIT(hi2c->Instance->CR1, I2C_CR1_ACK);

                if ((XferOptions == I2C_LAST_FRAME) || (XferOptions == I2C_OTHER_AND_LAST_FRAME) || (XferOptions == I2C_LAST_FRAME_NO_STOP))
                {
                    /* Enable Last DMA bit */
                    SET_BIT(hi2c->Instance->CR2, I2C_CR2_LAST);
                }
            }

            /* Set the I2C DMA transfer complete callback */
            hi2c->hdmarx->XferCpltCallback = I2C_DMAXferCplt;

            /* Set the DMA error callback */
            hi2c->hdmarx->XferErrorCallback = I2C_DMAError;

            /* Set the unused DMA callbacks to NULL */
            hi2c->hdmarx->XferHalfCpltCallback = NULL;
            hi2c->hdmarx->XferAbortCallback = NULL;

            /* Enable the DMA channel */
            dmaxferstatus = HAL_DMA_Start_IT(hi2c->hdmarx, (uint32_t)&hi2c->Instance->DR, (uint32_t)hi2c->pBuffPtr, hi2c->XferSize);

            if (dmaxferstatus == HAL_OK)
            {
                /* If transfer direction not change and there is no request to start another frame, do not generate Restart Condition */
                /* Mean Previous state is same as current state */
                if ((Prev_State != I2C_STATE_MASTER_BUSY_RX) || (IS_I2C_TRANSFER_OTHER_OPTIONS_REQUEST(XferOptions) == 1))
                {
                    /* Generate Start */
                    SET_BIT(hi2c->Instance->CR1, I2C_CR1_START);

                    /* Update interrupt for only EVT and ERR */
                    enableIT = (I2C_IT_EVT | I2C_IT_ERR);
                }
                else
                {
                    /* Update interrupt for only ERR */
                    enableIT = I2C_IT_ERR;
                }

                /* Process Unlocked */
                __HAL_UNLOCK(hi2c);

                /* Note : The I2C interrupts must be enabled after unlocking current process
                to avoid the risk of I2C interrupt handle execution before current
                process unlock */

                /* If XferOptions is not associated to a new frame, mean no start bit is request, enable directly the DMA request */
                /* In other cases, DMA request is enabled after Slave address treatment in IRQHandler */
                if ((XferOptions == I2C_NEXT_FRAME) || (XferOptions == I2C_LAST_FRAME) || (XferOptions == I2C_LAST_FRAME_NO_STOP))
                {
                    /* Enable DMA Request */
                    SET_BIT(hi2c->Instance->CR2, I2C_CR2_DMAEN);
                }

                /* Enable EVT and ERR interrupt */
                __HAL_I2C_ENABLE_IT(hi2c, enableIT);
            }
            else
            {
                /* Update I2C state */
                hi2c->State     = HAL_I2C_STATE_READY;
                hi2c->Mode      = HAL_I2C_MODE_NONE;

                /* Update I2C error code */
                hi2c->ErrorCode |= HAL_I2C_ERROR_DMA;

                /* Process Unlocked */
                __HAL_UNLOCK(hi2c);

                return HAL_ERROR;
            }
        }
        else
        {
            /* Enable Acknowledge */
            SET_BIT(hi2c->Instance->CR1, I2C_CR1_ACK);

            /* If transfer direction not change and there is no request to start another frame, do not generate Restart Condition */
            /* Mean Previous state is same as current state */
            if ((Prev_State != I2C_STATE_MASTER_BUSY_RX) || (IS_I2C_TRANSFER_OTHER_OPTIONS_REQUEST(XferOptions) == 1))
            {
                /* Generate Start */
                SET_BIT(hi2c->Instance->CR1, I2C_CR1_START);
            }

            /* Process Unlocked */
            __HAL_UNLOCK(hi2c);

            /* Note : The I2C interrupts must be enabled after unlocking current process
            to avoid the risk of I2C interrupt handle execution before current
            process unlock */

            /* Enable interrupts */
            __HAL_I2C_ENABLE_IT(hi2c, enableIT);
        }
        return HAL_OK;
    }
    else
    {
        return HAL_BUSY;
    }
}

/**
  * @brief  Sequential transmit in slave mode an amount of data in non-blocking mode with Interrupt
  * @note   This interface allow to manage repeated start condition when a direction change during transfer
  * @param  hi2c Pointer to a I2C_HandleTypeDef structure that contains
  *         the configuration information for the specified I2C.
  * @param  pData Pointer to data buffer
  * @param  Size Amount of data to be sent
  * @param  XferOptions Options of Transfer, value of @ref I2C_XferOptions_definition
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_I2C_Slave_Seq_Transmit_IT(I2C_HandleTypeDef *hi2c, uint8_t *pData, uint16_t Size, uint32_t XferOptions)
{
    /* Check the parameters */
    assert_param(IS_I2C_TRANSFER_OPTIONS_REQUEST(XferOptions));

