sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_i2c.c
            /* Update I2C error code */
            hi2c->ErrorCode |= HAL_I2C_ERROR_DMA;

            /* Process Unlocked */
            __HAL_UNLOCK(hi2c);

            return HAL_ERROR;
        }
    }
    else
    {
        return HAL_BUSY;
    }
}

/**
  * @brief  Sequential receive in slave mode an amount of data in non-blocking mode with Interrupt
  * @note   This interface allow to manage repeated start condition when a direction change during transfer
  * @param  hi2c Pointer to a I2C_HandleTypeDef structure that contains
  *         the configuration information for the specified I2C.
  * @param  pData Pointer to data buffer
  * @param  Size Amount of data to be sent
  * @param  XferOptions Options of Transfer, value of @ref I2C_XferOptions_definition
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_I2C_Slave_Seq_Receive_IT(I2C_HandleTypeDef *hi2c, uint8_t *pData, uint16_t Size, uint32_t XferOptions)
{
    /* Check the parameters */
    assert_param(IS_I2C_TRANSFER_OPTIONS_REQUEST(XferOptions));

    if (((uint32_t)hi2c->State & (uint32_t)HAL_I2C_STATE_LISTEN) == (uint32_t)HAL_I2C_STATE_LISTEN)
    {
        if ((pData == NULL) || (Size == 0U))
        {
            return  HAL_ERROR;
        }

        /* Process Locked */
        __HAL_LOCK(hi2c);

        /* Check if the I2C is already enabled */
        if ((hi2c->Instance->CR1 & I2C_CR1_PE) != I2C_CR1_PE)
        {
            /* Enable I2C peripheral */
            __HAL_I2C_ENABLE(hi2c);
        }

        /* Disable Pos */
        CLEAR_BIT(hi2c->Instance->CR1, I2C_CR1_POS);

        hi2c->State     = HAL_I2C_STATE_BUSY_RX_LISTEN;
        hi2c->Mode      = HAL_I2C_MODE_SLAVE;
        hi2c->ErrorCode = HAL_I2C_ERROR_NONE;

        /* Prepare transfer parameters */
        hi2c->pBuffPtr    = pData;
        hi2c->XferCount   = Size;
        hi2c->XferSize    = hi2c->XferCount;
        hi2c->XferOptions = XferOptions;

        /* Clear ADDR flag */
        __HAL_I2C_CLEAR_ADDRFLAG(hi2c);

        /* Process Unlocked */
        __HAL_UNLOCK(hi2c);

        /* Note : The I2C interrupts must be enabled after unlocking current process
                  to avoid the risk of I2C interrupt handle execution before current
                  process unlock */

        /* Enable EVT, BUF and ERR interrupt */
        __HAL_I2C_ENABLE_IT(hi2c, I2C_IT_EVT | I2C_IT_BUF | I2C_IT_ERR);

        return HAL_OK;
    }
    else
    {
        return HAL_BUSY;
    }
}

/**
  * @brief  Sequential receive in slave mode an amount of data in non-blocking mode with DMA
  * @note   This interface allow to manage repeated start condition when a direction change during transfer
  * @param  hi2c Pointer to a I2C_HandleTypeDef structure that contains
  *         the configuration information for the specified I2C.
  * @param  pData Pointer to data buffer
  * @param  Size Amount of data to be sent
  * @param  XferOptions Options of Transfer, value of @ref I2C_XferOptions_definition
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_I2C_Slave_Seq_Receive_DMA(I2C_HandleTypeDef *hi2c, uint8_t *pData, uint16_t Size, uint32_t XferOptions)
{
    HAL_StatusTypeDef dmaxferstatus;

    /* Check the parameters */
    assert_param(IS_I2C_TRANSFER_OPTIONS_REQUEST(XferOptions));

    if (((uint32_t)hi2c->State & (uint32_t)HAL_I2C_STATE_LISTEN) == (uint32_t)HAL_I2C_STATE_LISTEN)
    {
        if ((pData == NULL) || (Size == 0U))
        {
            return  HAL_ERROR;
        }

        /* Process Locked */
        __HAL_LOCK(hi2c);

        /* Disable Interrupts, to prevent preemption during treatment in case of multicall */
        __HAL_I2C_DISABLE_IT(hi2c, I2C_IT_EVT | I2C_IT_ERR);

        /* I2C cannot manage full duplex exchange so disable previous IT enabled if any */
        /* and then toggle the HAL slave RX state to TX state */
        if (hi2c->State == HAL_I2C_STATE_BUSY_RX_LISTEN)
        {
            if ((hi2c->Instance->CR2 & I2C_CR2_DMAEN) == I2C_CR2_DMAEN)
            {
                /* Abort DMA Xfer if any */
                if (hi2c->hdmarx != NULL)
                {
                    CLEAR_BIT(hi2c->Instance->CR2, I2C_CR2_DMAEN);

                    /* Set the I2C DMA Abort callback :
                     will lead to call HAL_I2C_ErrorCallback() at end of DMA abort procedure */
                    hi2c->hdmarx->XferAbortCallback = I2C_DMAAbort;

                    /* Abort DMA RX */
                    if (HAL_DMA_Abort_IT(hi2c->hdmarx) != HAL_OK)
                    {
                        /* Call Directly XferAbortCallback function in case of error */
                        hi2c->hdmarx->XferAbortCallback(hi2c->hdmarx);
                    }
                }
            }
        }
        else if (hi2c->State == HAL_I2C_STATE_BUSY_TX_LISTEN)
        {
            if ((hi2c->Instance->CR2 & I2C_CR2_DMAEN) == I2C_CR2_DMAEN)
            {
                CLEAR_BIT(hi2c->Instance->CR2, I2C_CR2_DMAEN);

                /* Abort DMA Xfer if any */
                if (hi2c->hdmatx != NULL)
                {
                    /* Set the I2C DMA Abort callback :
                     will lead to call HAL_I2C_ErrorCallback() at end of DMA abort procedure */
                    hi2c->hdmatx->XferAbortCallback = I2C_DMAAbort;

                    /* Abort DMA TX */
                    if (HAL_DMA_Abort_IT(hi2c->hdmatx) != HAL_OK)
                    {
                        /* Call Directly XferAbortCallback function in case of error */
                        hi2c->hdmatx->XferAbortCallback(hi2c->hdmatx);
                    }
                }
            }
        }
        else
        {
            /* Nothing to do */
        }

        /* Check if the I2C is already enabled */
        if ((hi2c->Instance->CR1 & I2C_CR1_PE) != I2C_CR1_PE)
        {
            /* Enable I2C peripheral */
            __HAL_I2C_ENABLE(hi2c);
        }

        /* Disable Pos */
        CLEAR_BIT(hi2c->Instance->CR1, I2C_CR1_POS);

        hi2c->State     = HAL_I2C_STATE_BUSY_RX_LISTEN;
        hi2c->Mode      = HAL_I2C_MODE_SLAVE;
        hi2c->ErrorCode = HAL_I2C_ERROR_NONE;

        /* Prepare transfer parameters */
        hi2c->pBuffPtr    = pData;
        hi2c->XferCount   = Size;
        hi2c->XferSize    = hi2c->XferCount;
        hi2c->XferOptions = XferOptions;

        /* Set the I2C DMA transfer complete callback */
        hi2c->hdmarx->XferCpltCallback = I2C_DMAXferCplt;

        /* Set the DMA error callback */
        hi2c->hdmarx->XferErrorCallback = I2C_DMAError;

        /* Set the unused DMA callbacks to NULL */
        hi2c->hdmarx->XferHalfCpltCallback = NULL;
        hi2c->hdmarx->XferAbortCallback = NULL;

        /* Enable the DMA channel */
        dmaxferstatus = HAL_DMA_Start_IT(hi2c->hdmarx, (uint32_t)&hi2c->Instance->DR, (uint32_t)hi2c->pBuffPtr, hi2c->XferSize);

        if (dmaxferstatus == HAL_OK)
        {
            /* Enable Address Acknowledge */
            SET_BIT(hi2c->Instance->CR1, I2C_CR1_ACK);

