sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_i2c.c
            /* Clear ADDR flag */
            __HAL_I2C_CLEAR_ADDRFLAG(hi2c);

            /* Process Unlocked */
            __HAL_UNLOCK(hi2c);

            /* Enable DMA Request */
            SET_BIT(hi2c->Instance->CR2, I2C_CR2_DMAEN);

            /* Note : The I2C interrupts must be enabled after unlocking current process
            to avoid the risk of I2C interrupt handle execution before current
            process unlock */
            /* Enable EVT and ERR interrupt */
            __HAL_I2C_ENABLE_IT(hi2c, I2C_IT_EVT | I2C_IT_ERR);

            return HAL_OK;
        }
        else
        {
            /* Update I2C state */
            hi2c->State     = HAL_I2C_STATE_READY;
            hi2c->Mode      = HAL_I2C_MODE_NONE;

            /* Update I2C error code */
            hi2c->ErrorCode |= HAL_I2C_ERROR_DMA;

            /* Process Unlocked */
            __HAL_UNLOCK(hi2c);

            return HAL_ERROR;
        }
    }
    else
    {
        return HAL_BUSY;
    }
}

/**
  * @brief  Enable the Address listen mode with Interrupt.
  * @param  hi2c Pointer to a I2C_HandleTypeDef structure that contains
  *                the configuration information for the specified I2C.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_I2C_EnableListen_IT(I2C_HandleTypeDef *hi2c)
{
    if (hi2c->State == HAL_I2C_STATE_READY)
    {
        hi2c->State = HAL_I2C_STATE_LISTEN;

        /* Check if the I2C is already enabled */
        if ((hi2c->Instance->CR1 & I2C_CR1_PE) != I2C_CR1_PE)
        {
            /* Enable I2C peripheral */
            __HAL_I2C_ENABLE(hi2c);
        }

        /* Enable Address Acknowledge */
        SET_BIT(hi2c->Instance->CR1, I2C_CR1_ACK);

        /* Enable EVT and ERR interrupt */
        __HAL_I2C_ENABLE_IT(hi2c, I2C_IT_EVT | I2C_IT_ERR);

        return HAL_OK;
    }
    else
    {
        return HAL_BUSY;
    }
}

/**
  * @brief  Disable the Address listen mode with Interrupt.
  * @param  hi2c Pointer to a I2C_HandleTypeDef structure that contains
  *                the configuration information for the specified I2C.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_I2C_DisableListen_IT(I2C_HandleTypeDef *hi2c)
{
    /* Declaration of tmp to prevent undefined behavior of volatile usage */
    uint32_t tmp;

    /* Disable Address listen mode only if a transfer is not ongoing */
    if (hi2c->State == HAL_I2C_STATE_LISTEN)
    {
        tmp = (uint32_t)(hi2c->State) & I2C_STATE_MSK;
        hi2c->PreviousState = tmp | (uint32_t)(hi2c->Mode);
        hi2c->State = HAL_I2C_STATE_READY;
        hi2c->Mode = HAL_I2C_MODE_NONE;

        /* Disable Address Acknowledge */
        CLEAR_BIT(hi2c->Instance->CR1, I2C_CR1_ACK);

        /* Disable EVT and ERR interrupt */
        __HAL_I2C_DISABLE_IT(hi2c, I2C_IT_EVT | I2C_IT_ERR);

        return HAL_OK;
    }
    else
    {
        return HAL_BUSY;
    }
}

/**
  * @brief  Abort a master I2C IT or DMA process communication with Interrupt.
  * @param  hi2c Pointer to a I2C_HandleTypeDef structure that contains
  *         the configuration information for the specified I2C.
  * @param  DevAddress Target device address: The device 7 bits address value
  *         in datasheet must be shifted to the left before calling the interface
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_I2C_Master_Abort_IT(I2C_HandleTypeDef *hi2c, uint16_t DevAddress)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(DevAddress);

    /* Abort Master transfer during Receive or Transmit process    */
    if (hi2c->Mode == HAL_I2C_MODE_MASTER)
    {
        /* Process Locked */
        __HAL_LOCK(hi2c);

        hi2c->PreviousState = I2C_STATE_NONE;
        hi2c->State = HAL_I2C_STATE_ABORT;

        /* Disable Acknowledge */
        CLEAR_BIT(hi2c->Instance->CR1, I2C_CR1_ACK);

        /* Generate Stop */
        SET_BIT(hi2c->Instance->CR1, I2C_CR1_STOP);

        hi2c->XferCount = 0U;

        /* Disable EVT, BUF and ERR interrupt */
        __HAL_I2C_DISABLE_IT(hi2c, I2C_IT_EVT | I2C_IT_BUF | I2C_IT_ERR);

        /* Process Unlocked */
        __HAL_UNLOCK(hi2c);

        /* Call the corresponding callback to inform upper layer of End of Transfer */
        I2C_ITError(hi2c);

        return HAL_OK;
    }
    else
    {
        /* Wrong usage of abort function */
        /* This function should be used only in case of abort monitored by master device */
        return HAL_ERROR;
    }
}

/**
  * @}
  */

/** @defgroup I2C_IRQ_Handler_and_Callbacks IRQ Handler and Callbacks
 * @{
 */

/**
  * @brief  This function handles I2C event interrupt request.
  * @param  hi2c Pointer to a I2C_HandleTypeDef structure that contains
  *                the configuration information for the specified I2C.
  * @retval None
  */
void HAL_I2C_EV_IRQHandler(I2C_HandleTypeDef *hi2c)
{
    uint32_t sr1itflags;
    uint32_t sr2itflags               = 0U;
    uint32_t itsources                = READ_REG(hi2c->Instance->CR2);
    uint32_t CurrentXferOptions       = hi2c->XferOptions;
    HAL_I2C_ModeTypeDef CurrentMode   = hi2c->Mode;
    HAL_I2C_StateTypeDef CurrentState = hi2c->State;

    /* Master or Memory mode selected */
    if ((CurrentMode == HAL_I2C_MODE_MASTER) || (CurrentMode == HAL_I2C_MODE_MEM))
    {
        sr2itflags   = READ_REG(hi2c->Instance->SR2);
        sr1itflags   = READ_REG(hi2c->Instance->SR1);

        /* Exit IRQ event until Start Bit detected in case of Other frame requested */
        if ((I2C_CHECK_FLAG(sr1itflags, I2C_FLAG_SB) == RESET) && (IS_I2C_TRANSFER_OTHER_OPTIONS_REQUEST(CurrentXferOptions) == 1U))
        {
            return;
        }

        /* SB Set ----------------------------------------------------------------*/
        if ((I2C_CHECK_FLAG(sr1itflags, I2C_FLAG_SB) != RESET) && (I2C_CHECK_IT_SOURCE(itsources, I2C_IT_EVT) != RESET))
        {
            /* Convert OTHER_xxx XferOptions if any */
            I2C_ConvertOtherXferOptions(hi2c);

            I2C_Master_SB(hi2c);
        }
        /* ADD10 Set -------------------------------------------------------------*/
        else if ((I2C_CHECK_FLAG(sr1itflags, I2C_FLAG_ADD10) != RESET) && (I2C_CHECK_IT_SOURCE(itsources, I2C_IT_EVT) != RESET))
        {
            I2C_Master_ADD10(hi2c);
        }
        /* ADDR Set --------------------------------------------------------------*/
        else if ((I2C_CHECK_FLAG(sr1itflags, I2C_FLAG_ADDR) != RESET) && (I2C_CHECK_IT_SOURCE(itsources, I2C_IT_EVT) != RESET))
        {
            I2C_Master_ADDR(hi2c);
        }
        /* I2C in mode Transmitter -----------------------------------------------*/
        else if (I2C_CHECK_FLAG(sr2itflags, I2C_FLAG_TRA) != RESET)
        {
            /* Do not check buffer and BTF flag if a Xfer DMA is on going */
            if (READ_BIT(hi2c->Instance->CR2, I2C_CR2_DMAEN) != I2C_CR2_DMAEN)
            {
                /* TXE set and BTF reset -----------------------------------------------*/
                if ((I2C_CHECK_FLAG(sr1itflags, I2C_FLAG_TXE) != RESET) && (I2C_CHECK_IT_SOURCE(itsources, I2C_IT_BUF) != RESET) && (I2C_CHECK_FLAG(sr1itflags, I2C_FLAG_BTF) == RESET))
                {
                    I2C_MasterTransmit_TXE(hi2c);
                }
                /* BTF set -------------------------------------------------------------*/
                else if ((I2C_CHECK_FLAG(sr1itflags, I2C_FLAG_BTF) != RESET) && (I2C_CHECK_IT_SOURCE(itsources, I2C_IT_EVT) != RESET))
                {
                    I2C_MasterTransmit_BTF(hi2c);
                }
                else
                {
                    /* Do nothing */
                }
            }
        }
        /* I2C in mode Receiver --------------------------------------------------*/
        else
        {
            /* Do not check buffer and BTF flag if a Xfer DMA is on going */
            if (READ_BIT(hi2c->Instance->CR2, I2C_CR2_DMAEN) != I2C_CR2_DMAEN)
            {
                /* RXNE set and BTF reset -----------------------------------------------*/
                if ((I2C_CHECK_FLAG(sr1itflags, I2C_FLAG_RXNE) != RESET) && (I2C_CHECK_IT_SOURCE(itsources, I2C_IT_BUF) != RESET) && (I2C_CHECK_FLAG(sr1itflags, I2C_FLAG_BTF) == RESET))
                {
                    I2C_MasterReceive_RXNE(hi2c);
                }
                /* BTF set -------------------------------------------------------------*/
                else if ((I2C_CHECK_FLAG(sr1itflags, I2C_FLAG_BTF) != RESET) && (I2C_CHECK_IT_SOURCE(itsources, I2C_IT_EVT) != RESET))
                {
                    I2C_MasterReceive_BTF(hi2c);
                }
                else
                {
                    /* Do nothing */
                }
            }
        }
    }
    /* Slave mode selected */
    else
    {
        /* If an error is detected, read only SR1 register to prevent */
        /* a clear of ADDR flags by reading SR2 after reading SR1 in Error treatment */
        if (hi2c->ErrorCode != HAL_I2C_ERROR_NONE)
        {
            sr1itflags   = READ_REG(hi2c->Instance->SR1);
        }
        else
        {
            sr2itflags   = READ_REG(hi2c->Instance->SR2);
            sr1itflags   = READ_REG(hi2c->Instance->SR1);
        }

