sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_i2c.c
        /* ADDR set --------------------------------------------------------------*/
        if ((I2C_CHECK_FLAG(sr1itflags, I2C_FLAG_ADDR) != RESET) && (I2C_CHECK_IT_SOURCE(itsources, I2C_IT_EVT) != RESET))
        {
            /* Now time to read SR2, this will clear ADDR flag automatically */
            if (hi2c->ErrorCode != HAL_I2C_ERROR_NONE)
            {
                sr2itflags   = READ_REG(hi2c->Instance->SR2);
            }
            I2C_Slave_ADDR(hi2c, sr2itflags);
        }
        /* STOPF set --------------------------------------------------------------*/
        else if (I2C_CHECK_FLAG(sr1itflags, I2C_FLAG_STOPF) != RESET)
//			else if ((I2C_CHECK_FLAG(sr1itflags, I2C_FLAG_STOPF) != RESET) && (I2C_CHECK_IT_SOURCE(itsources, I2C_IT_EVT) != RESET))
        {
            I2C_Slave_STOPF(hi2c);
        }
        /* I2C in mode Transmitter -----------------------------------------------*/
        else if ((CurrentState == HAL_I2C_STATE_BUSY_TX) || (CurrentState == HAL_I2C_STATE_BUSY_TX_LISTEN))
        {
            /* TXE set and BTF reset -----------------------------------------------*/
            if ((I2C_CHECK_FLAG(sr1itflags, I2C_FLAG_TXE) != RESET) && (I2C_CHECK_IT_SOURCE(itsources, I2C_IT_BUF) != RESET) && (I2C_CHECK_FLAG(sr1itflags, I2C_FLAG_BTF) == RESET))
            {
                I2C_SlaveTransmit_TXE(hi2c);
            }
            /* BTF set -------------------------------------------------------------*/
            else if ((I2C_CHECK_FLAG(sr1itflags, I2C_FLAG_BTF) != RESET) && (I2C_CHECK_IT_SOURCE(itsources, I2C_IT_EVT) != RESET))
            {
                I2C_SlaveTransmit_BTF(hi2c);
            }
            else
            {
                /* Do nothing */
            }
        }
        /* I2C in mode Receiver --------------------------------------------------*/
        else
        {
            /* RXNE set and BTF reset ----------------------------------------------*/
            if ((I2C_CHECK_FLAG(sr1itflags, I2C_FLAG_RXNE) != RESET) && (I2C_CHECK_IT_SOURCE(itsources, I2C_IT_BUF) != RESET) && (I2C_CHECK_FLAG(sr1itflags, I2C_FLAG_BTF) == RESET))
            {
                I2C_SlaveReceive_RXNE(hi2c);
            }
            /* BTF set -------------------------------------------------------------*/
            else if ((I2C_CHECK_FLAG(sr1itflags, I2C_FLAG_BTF) != RESET) && (I2C_CHECK_IT_SOURCE(itsources, I2C_IT_EVT) != RESET))
            {
                I2C_SlaveReceive_BTF(hi2c);
            }
            else
            {
                /* Do nothing */
            }
        }
    }
}

/**
  * @brief  This function handles I2C error interrupt request.
  * @param  hi2c Pointer to a I2C_HandleTypeDef structure that contains
  *                the configuration information for the specified I2C.
  * @retval None
  */
void HAL_I2C_ER_IRQHandler(I2C_HandleTypeDef *hi2c)
{
    HAL_I2C_ModeTypeDef tmp1;
    uint32_t tmp2;
    HAL_I2C_StateTypeDef tmp3;
    uint32_t tmp4;
    uint32_t sr1itflags = READ_REG(hi2c->Instance->SR1);
    uint32_t itsources  = READ_REG(hi2c->Instance->CR2);
    uint32_t error      = HAL_I2C_ERROR_NONE;

    /* I2C Bus error interrupt occurred ----------------------------------------*/
    if ((I2C_CHECK_FLAG(sr1itflags, I2C_FLAG_BERR) != RESET) && (I2C_CHECK_IT_SOURCE(itsources, I2C_IT_ERR) != RESET))
    {
        error |= HAL_I2C_ERROR_BERR;

        /* Clear BERR flag */
        __HAL_I2C_CLEAR_FLAG(hi2c, I2C_FLAG_BERR);

        /* Workaround: Start cannot be generated after a misplaced Stop */
        SET_BIT(hi2c->Instance->CR1, I2C_CR1_SWRST);
    }

    /* I2C Arbitration Lost error interrupt occurred ---------------------------*/
    if ((I2C_CHECK_FLAG(sr1itflags, I2C_FLAG_ARLO) != RESET) && (I2C_CHECK_IT_SOURCE(itsources, I2C_IT_ERR) != RESET))
    {
        error |= HAL_I2C_ERROR_ARLO;

        /* Clear ARLO flag */
        __HAL_I2C_CLEAR_FLAG(hi2c, I2C_FLAG_ARLO);
    }

    /* I2C Acknowledge failure error interrupt occurred ------------------------*/
    if ((I2C_CHECK_FLAG(sr1itflags, I2C_FLAG_AF) != RESET) && (I2C_CHECK_IT_SOURCE(itsources, I2C_IT_ERR) != RESET))
    {
        tmp1 = hi2c->Mode;
        tmp2 = hi2c->XferCount;
        tmp3 = hi2c->State;
        tmp4 = hi2c->PreviousState;
        if ((tmp1 == HAL_I2C_MODE_SLAVE) && (tmp2 == 0U) && \
                ((tmp3 == HAL_I2C_STATE_BUSY_TX) || (tmp3 == HAL_I2C_STATE_BUSY_TX_LISTEN) || \
                 ((tmp3 == HAL_I2C_STATE_LISTEN) && (tmp4 == I2C_STATE_SLAVE_BUSY_TX))))
        {
            I2C_Slave_AF(hi2c);
        }
        else
        {
            /* Clear AF flag */
            __HAL_I2C_CLEAR_FLAG(hi2c, I2C_FLAG_AF);

            error |= HAL_I2C_ERROR_AF;

            /* Do not generate a STOP in case of Slave receive non acknowledge during transfer (mean not at the end of transfer) */
            if (hi2c->Mode == HAL_I2C_MODE_MASTER)
            {
                /* Generate Stop */
                SET_BIT(hi2c->Instance->CR1, I2C_CR1_STOP);
            }
        }
    }

    /* I2C Over-Run/Under-Run interrupt occurred -------------------------------*/
    if ((I2C_CHECK_FLAG(sr1itflags, I2C_FLAG_OVR) != RESET) && (I2C_CHECK_IT_SOURCE(itsources, I2C_IT_ERR) != RESET))
    {
        error |= HAL_I2C_ERROR_OVR;
        /* Clear OVR flag */
        __HAL_I2C_CLEAR_FLAG(hi2c, I2C_FLAG_OVR);
    }

    /* Call the Error Callback in case of Error detected -----------------------*/
    if (error != HAL_I2C_ERROR_NONE)
    {
        hi2c->ErrorCode |= error;
        I2C_ITError(hi2c);
    }
}

/**
  * @brief  Master Tx Transfer completed callback.
  * @param  hi2c Pointer to a I2C_HandleTypeDef structure that contains
  *                the configuration information for the specified I2C.
  * @retval None
  */
__weak void HAL_I2C_MasterTxCpltCallback(I2C_HandleTypeDef *hi2c)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hi2c);

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_I2C_MasterTxCpltCallback could be implemented in the user file
     */
}

/**
  * @brief  Master Rx Transfer completed callback.
  * @param  hi2c Pointer to a I2C_HandleTypeDef structure that contains
  *                the configuration information for the specified I2C.
  * @retval None
  */
__weak void HAL_I2C_MasterRxCpltCallback(I2C_HandleTypeDef *hi2c)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hi2c);

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_I2C_MasterRxCpltCallback could be implemented in the user file
     */
}

