sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_i2c.c
    if ((hi2c->XferSize == 0U) && (CurrentState == HAL_I2C_STATE_BUSY_TX))
    {
        /* Call TxCpltCallback() directly if no stop mode is set */
        if ((CurrentXferOptions != I2C_FIRST_AND_LAST_FRAME) && (CurrentXferOptions != I2C_LAST_FRAME) && (CurrentXferOptions != I2C_NO_OPTION_FRAME))
        {
            __HAL_I2C_DISABLE_IT(hi2c, I2C_IT_EVT | I2C_IT_BUF | I2C_IT_ERR);

            hi2c->PreviousState = I2C_STATE_MASTER_BUSY_TX;
            hi2c->Mode = HAL_I2C_MODE_NONE;
            hi2c->State = HAL_I2C_STATE_READY;

#if (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
            hi2c->MasterTxCpltCallback(hi2c);
#else
            HAL_I2C_MasterTxCpltCallback(hi2c);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
        }
        else /* Generate Stop condition then Call TxCpltCallback() */
        {
            /* Disable EVT, BUF and ERR interrupt */
            __HAL_I2C_DISABLE_IT(hi2c, I2C_IT_EVT | I2C_IT_BUF | I2C_IT_ERR);

            /* Generate Stop */
            SET_BIT(hi2c->Instance->CR1, I2C_CR1_STOP);

            hi2c->PreviousState = I2C_STATE_NONE;
            hi2c->State = HAL_I2C_STATE_READY;

            if (hi2c->Mode == HAL_I2C_MODE_MEM)
            {
                hi2c->Mode = HAL_I2C_MODE_NONE;
#if (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
                hi2c->MemTxCpltCallback(hi2c);
#else
                HAL_I2C_MemTxCpltCallback(hi2c);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
            }
            else
            {
                hi2c->Mode = HAL_I2C_MODE_NONE;
#if (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
                hi2c->MasterTxCpltCallback(hi2c);
#else
                HAL_I2C_MasterTxCpltCallback(hi2c);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
            }
        }
    }
    else if ((CurrentState == HAL_I2C_STATE_BUSY_TX) || \
             ((CurrentMode == HAL_I2C_MODE_MEM) && (CurrentState == HAL_I2C_STATE_BUSY_RX)))
    {
        if (hi2c->XferCount == 0U)
        {
            /* Disable BUF interrupt */
            __HAL_I2C_DISABLE_IT(hi2c, I2C_IT_BUF);
        }
        else
        {
            if (hi2c->Mode == HAL_I2C_MODE_MEM)
            {
                if (hi2c->EventCount == 0U)
                {
                    /* If Memory address size is 8Bit */
                    if (hi2c->MemaddSize == I2C_MEMADD_SIZE_8BIT)
                    {
                        /* Send Memory Address */
                        hi2c->Instance->DR = I2C_MEM_ADD_LSB(hi2c->Memaddress);

                        hi2c->EventCount += 2U;
                    }
                    /* If Memory address size is 16Bit */
                    else
                    {
                        /* Send MSB of Memory Address */
                        hi2c->Instance->DR = I2C_MEM_ADD_MSB(hi2c->Memaddress);

                        hi2c->EventCount++;
                    }
                }
                else if (hi2c->EventCount == 1U)
                {
                    /* Send LSB of Memory Address */
                    hi2c->Instance->DR = I2C_MEM_ADD_LSB(hi2c->Memaddress);

                    hi2c->EventCount++;
                }
                else if (hi2c->EventCount == 2U)
                {
                    if (hi2c->State == HAL_I2C_STATE_BUSY_RX)
                    {
                        /* Generate Restart */
                        hi2c->Instance->CR1 |= I2C_CR1_START;
                    }
                    else if (hi2c->State == HAL_I2C_STATE_BUSY_TX)
                    {
                        /* Write data to DR */
                        hi2c->Instance->DR = *hi2c->pBuffPtr;

                        /* Increment Buffer pointer */
                        hi2c->pBuffPtr++;

                        /* Update counter */
                        hi2c->XferCount--;
                    }
                    else
                    {
                        /* Do nothing */
                    }
                }
                else
                {
                    /* Do nothing */
                }
            }
            else
            {
                /* Write data to DR */
                hi2c->Instance->DR = *hi2c->pBuffPtr;

                /* Increment Buffer pointer */
                hi2c->pBuffPtr++;

                /* Update counter */
                hi2c->XferCount--;
            }
        }
    }
    else
    {
        /* Do nothing */
    }
}

/**
  * @brief  Handle BTF flag for Master transmitter
  * @param  hi2c Pointer to a I2C_HandleTypeDef structure that contains
  *         the configuration information for I2C module
  * @retval None
  */
static void I2C_MasterTransmit_BTF(I2C_HandleTypeDef *hi2c)
{
    /* Declaration of temporary variables to prevent undefined behavior of volatile usage */
    uint32_t CurrentXferOptions = hi2c->XferOptions;

    if (hi2c->State == HAL_I2C_STATE_BUSY_TX)
    {
        if (hi2c->XferCount != 0U)
        {
            /* Write data to DR */
            hi2c->Instance->DR = *hi2c->pBuffPtr;

            /* Increment Buffer pointer */
            hi2c->pBuffPtr++;

            /* Update counter */
            hi2c->XferCount--;
        }
        else
        {
            /* Call TxCpltCallback() directly if no stop mode is set */
            if ((CurrentXferOptions != I2C_FIRST_AND_LAST_FRAME) && (CurrentXferOptions != I2C_LAST_FRAME) && (CurrentXferOptions != I2C_NO_OPTION_FRAME))
            {
                __HAL_I2C_DISABLE_IT(hi2c, I2C_IT_EVT | I2C_IT_BUF | I2C_IT_ERR);

                hi2c->PreviousState = I2C_STATE_MASTER_BUSY_TX;
                hi2c->Mode = HAL_I2C_MODE_NONE;
                hi2c->State = HAL_I2C_STATE_READY;

#if (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
                hi2c->MasterTxCpltCallback(hi2c);
#else
                HAL_I2C_MasterTxCpltCallback(hi2c);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
            }
            else /* Generate Stop condition then Call TxCpltCallback() */
            {
                /* Disable EVT, BUF and ERR interrupt */
                __HAL_I2C_DISABLE_IT(hi2c, I2C_IT_EVT | I2C_IT_BUF | I2C_IT_ERR);

                /* Generate Stop */
                SET_BIT(hi2c->Instance->CR1, I2C_CR1_STOP);

                hi2c->PreviousState = I2C_STATE_NONE;
                hi2c->State = HAL_I2C_STATE_READY;

                if (hi2c->Mode == HAL_I2C_MODE_MEM)
                {
                    hi2c->Mode = HAL_I2C_MODE_NONE;
#if (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
                    hi2c->MemTxCpltCallback(hi2c);
#else
                    HAL_I2C_MemTxCpltCallback(hi2c);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
                }
                else
                {
                    hi2c->Mode = HAL_I2C_MODE_NONE;

#if (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
                    hi2c->MasterTxCpltCallback(hi2c);
#else
                    HAL_I2C_MasterTxCpltCallback(hi2c);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
                }
            }
        }
    }
}

/**
  * @brief  Handle RXNE flag for Master
  * @param  hi2c Pointer to a I2C_HandleTypeDef structure that contains
  *         the configuration information for I2C module
  * @retval None
  */
static void I2C_MasterReceive_RXNE(I2C_HandleTypeDef *hi2c)
{
    if (hi2c->State == HAL_I2C_STATE_BUSY_RX)
    {
        uint32_t tmp;

