sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_i2c.c
        tmp = hi2c->XferCount;
        if (tmp > 3U)
        {
            /* Read data from DR */
            *hi2c->pBuffPtr = (uint8_t)hi2c->Instance->DR;

            /* Increment Buffer pointer */
            hi2c->pBuffPtr++;

            /* Update counter */
            hi2c->XferCount--;

            if (hi2c->XferCount == (uint16_t)3)
            {
                /* Disable BUF interrupt, this help to treat correctly the last 4 bytes
                on BTF subroutine */
                /* Disable BUF interrupt */
                __HAL_I2C_DISABLE_IT(hi2c, I2C_IT_BUF);
            }
        }
        else if ((hi2c->XferOptions != I2C_FIRST_AND_NEXT_FRAME) && ((tmp == 1U) || (tmp == 0U)))
        {
            /* Disable Acknowledge */
            CLEAR_BIT(hi2c->Instance->CR1, I2C_CR1_ACK);

            /* Disable EVT, BUF and ERR interrupt */
            __HAL_I2C_DISABLE_IT(hi2c, I2C_IT_EVT | I2C_IT_BUF | I2C_IT_ERR);

            /* Read data from DR */
            *hi2c->pBuffPtr = (uint8_t)hi2c->Instance->DR;

            /* Increment Buffer pointer */
            hi2c->pBuffPtr++;

            /* Update counter */
            hi2c->XferCount--;

            hi2c->State = HAL_I2C_STATE_READY;

            if (hi2c->Mode == HAL_I2C_MODE_MEM)
            {
                hi2c->Mode = HAL_I2C_MODE_NONE;
                hi2c->PreviousState = I2C_STATE_NONE;

#if (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
                hi2c->MemRxCpltCallback(hi2c);
#else
                HAL_I2C_MemRxCpltCallback(hi2c);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
            }
            else
            {
                hi2c->Mode = HAL_I2C_MODE_NONE;
                hi2c->PreviousState = I2C_STATE_MASTER_BUSY_RX;

#if (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
                hi2c->MasterRxCpltCallback(hi2c);
#else
                HAL_I2C_MasterRxCpltCallback(hi2c);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
            }
        }
        else
        {
            /* Do nothing */
        }
    }
}

/**
  * @brief  Handle BTF flag for Master receiver
  * @param  hi2c Pointer to a I2C_HandleTypeDef structure that contains
  *         the configuration information for I2C module
  * @retval None
  */
static void I2C_MasterReceive_BTF(I2C_HandleTypeDef *hi2c)
{
    /* Declaration of temporary variables to prevent undefined behavior of volatile usage */
    uint32_t CurrentXferOptions = hi2c->XferOptions;

    if (hi2c->XferCount == 4U)
    {
        /* Disable BUF interrupt, this help to treat correctly the last 2 bytes
           on BTF subroutine if there is a reception delay between N-1 and N byte */
        __HAL_I2C_DISABLE_IT(hi2c, I2C_IT_BUF);

        /* Read data from DR */
        *hi2c->pBuffPtr = (uint8_t)hi2c->Instance->DR;

        /* Increment Buffer pointer */
        hi2c->pBuffPtr++;

        /* Update counter */
        hi2c->XferCount--;
    }
    else if (hi2c->XferCount == 3U)
    {
        /* Disable BUF interrupt, this help to treat correctly the last 2 bytes
           on BTF subroutine if there is a reception delay between N-1 and N byte */
        __HAL_I2C_DISABLE_IT(hi2c, I2C_IT_BUF);

        if ((CurrentXferOptions != I2C_NEXT_FRAME) && (CurrentXferOptions != I2C_FIRST_AND_NEXT_FRAME))
        {
            /* Disable Acknowledge */
            CLEAR_BIT(hi2c->Instance->CR1, I2C_CR1_ACK);
        }

        /* Read data from DR */
        *hi2c->pBuffPtr = (uint8_t)hi2c->Instance->DR;

        /* Increment Buffer pointer */
        hi2c->pBuffPtr++;

        /* Update counter */
        hi2c->XferCount--;
    }
    else if (hi2c->XferCount == 2U)
    {
        /* Prepare next transfer or stop current transfer */
        if ((CurrentXferOptions == I2C_FIRST_FRAME) || (CurrentXferOptions == I2C_LAST_FRAME_NO_STOP))
        {
            /* Disable Acknowledge */
            CLEAR_BIT(hi2c->Instance->CR1, I2C_CR1_ACK);
        }
        else if ((CurrentXferOptions == I2C_NEXT_FRAME) || (CurrentXferOptions == I2C_FIRST_AND_NEXT_FRAME))
        {
            /* Enable Acknowledge */
            SET_BIT(hi2c->Instance->CR1, I2C_CR1_ACK);
        }
        else if (CurrentXferOptions != I2C_LAST_FRAME_NO_STOP)
        {
            /* Generate Stop */
            SET_BIT(hi2c->Instance->CR1, I2C_CR1_STOP);
        }
        else
        {
            /* Do nothing */
        }

        /* Read data from DR */
        *hi2c->pBuffPtr = (uint8_t)hi2c->Instance->DR;

        /* Increment Buffer pointer */
        hi2c->pBuffPtr++;

        /* Update counter */
        hi2c->XferCount--;

        /* Read data from DR */
        *hi2c->pBuffPtr = (uint8_t)hi2c->Instance->DR;

        /* Increment Buffer pointer */
        hi2c->pBuffPtr++;

        /* Update counter */
        hi2c->XferCount--;

        /* Disable EVT and ERR interrupt */
        __HAL_I2C_DISABLE_IT(hi2c, I2C_IT_EVT | I2C_IT_ERR);

        hi2c->State = HAL_I2C_STATE_READY;
        if (hi2c->Mode == HAL_I2C_MODE_MEM)
        {
            hi2c->Mode = HAL_I2C_MODE_NONE;
            hi2c->PreviousState = I2C_STATE_NONE;
#if (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
            hi2c->MemRxCpltCallback(hi2c);
#else
            HAL_I2C_MemRxCpltCallback(hi2c);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
        }
        else
        {
            hi2c->Mode = HAL_I2C_MODE_NONE;
            hi2c->PreviousState = I2C_STATE_MASTER_BUSY_RX;
#if (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
            hi2c->MasterRxCpltCallback(hi2c);
#else
            HAL_I2C_MasterRxCpltCallback(hi2c);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
        }
    }
    else
    {
        /* Read data from DR */
        *hi2c->pBuffPtr = (uint8_t)hi2c->Instance->DR;

        /* Increment Buffer pointer */
        hi2c->pBuffPtr++;

        /* Update counter */
        hi2c->XferCount--;
    }
}

/**
  * @brief  Handle SB flag for Master
  * @param  hi2c Pointer to a I2C_HandleTypeDef structure that contains
  *         the configuration information for I2C module
  * @retval None
  */
static void I2C_Master_SB(I2C_HandleTypeDef *hi2c)
{
    if (hi2c->Mode == HAL_I2C_MODE_MEM)
    {
        if (hi2c->EventCount == 0U)
        {
            /* Send slave address */
            hi2c->Instance->DR = I2C_7BIT_ADD_WRITE(hi2c->Devaddress);
        }
        else
        {
            hi2c->Instance->DR = I2C_7BIT_ADD_READ(hi2c->Devaddress);
        }
    }
    else
    {
        /* Send slave 7 Bits address */
        if (hi2c->State == HAL_I2C_STATE_BUSY_TX)
        {
            hi2c->Instance->DR = I2C_7BIT_ADD_WRITE(hi2c->Devaddress);
        }
        else
        {
            hi2c->Instance->DR = I2C_7BIT_ADD_READ(hi2c->Devaddress);
        }

        if ((hi2c->hdmatx != NULL) || (hi2c->hdmarx != NULL))
        {
            if ((hi2c->hdmatx->XferCpltCallback != NULL) || (hi2c->hdmarx->XferCpltCallback != NULL))
            {
                /* Enable DMA Request */
                SET_BIT(hi2c->Instance->CR2, I2C_CR2_DMAEN);
            }
        }

