sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_i2c.c
    if (hi2c->XferCount != 0U)
    {
        /* Write data to DR */
        hi2c->Instance->DR = *hi2c->pBuffPtr;

        /* Increment Buffer pointer */
        hi2c->pBuffPtr++;

        /* Update counter */
        hi2c->XferCount--;

        if ((hi2c->XferCount == 0U) && (CurrentState == HAL_I2C_STATE_BUSY_TX_LISTEN))
        {
            /* Last Byte is received, disable Interrupt */
            __HAL_I2C_DISABLE_IT(hi2c, I2C_IT_BUF);

            /* Set state at HAL_I2C_STATE_LISTEN */
            hi2c->PreviousState = I2C_STATE_SLAVE_BUSY_TX;
            hi2c->State = HAL_I2C_STATE_LISTEN;

            /* Call the corresponding callback to inform upper layer of End of Transfer */
#if (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
            hi2c->SlaveTxCpltCallback(hi2c);
#else
            HAL_I2C_SlaveTxCpltCallback(hi2c);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
        }
    }
}

/**
  * @brief  Handle BTF flag for Slave transmitter
  * @param  hi2c Pointer to a I2C_HandleTypeDef structure that contains
  *         the configuration information for I2C module
  * @retval None
  */
static void I2C_SlaveTransmit_BTF(I2C_HandleTypeDef *hi2c)
{
    if (hi2c->XferCount != 0U)
    {
        /* Write data to DR */
        hi2c->Instance->DR = *hi2c->pBuffPtr;

        /* Increment Buffer pointer */
        hi2c->pBuffPtr++;

        /* Update counter */
        hi2c->XferCount--;
    }
}

/**
  * @brief  Handle RXNE flag for Slave
  * @param  hi2c Pointer to a I2C_HandleTypeDef structure that contains
  *         the configuration information for I2C module
  * @retval None
  */
static void I2C_SlaveReceive_RXNE(I2C_HandleTypeDef *hi2c)
{
    /* Declaration of temporary variables to prevent undefined behavior of volatile usage */
    HAL_I2C_StateTypeDef CurrentState = hi2c->State;

    if (hi2c->XferCount != 0U)
    {
        /* Read data from DR */
        *hi2c->pBuffPtr = (uint8_t)hi2c->Instance->DR;

        /* Increment Buffer pointer */
        hi2c->pBuffPtr++;

        /* Update counter */
        hi2c->XferCount--;

        if ((hi2c->XferCount == 0U) && (CurrentState == HAL_I2C_STATE_BUSY_RX_LISTEN))
        {
            /* Last Byte is received, disable Interrupt */
            __HAL_I2C_DISABLE_IT(hi2c, I2C_IT_BUF);

            /* Set state at HAL_I2C_STATE_LISTEN */
            hi2c->PreviousState = I2C_STATE_SLAVE_BUSY_RX;
            hi2c->State = HAL_I2C_STATE_LISTEN;

            /* Call the corresponding callback to inform upper layer of End of Transfer */
#if (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
            hi2c->SlaveRxCpltCallback(hi2c);
#else
            HAL_I2C_SlaveRxCpltCallback(hi2c);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
        }
    }
}

/**
  * @brief  Handle BTF flag for Slave receiver
  * @param  hi2c Pointer to a I2C_HandleTypeDef structure that contains
  *         the configuration information for I2C module
  * @retval None
  */
static void I2C_SlaveReceive_BTF(I2C_HandleTypeDef *hi2c)
{
    if (hi2c->XferCount != 0U)
    {
        /* Read data from DR */
        *hi2c->pBuffPtr = (uint8_t)hi2c->Instance->DR;

        /* Increment Buffer pointer */
        hi2c->pBuffPtr++;

        /* Update counter */
        hi2c->XferCount--;
    }
}

/**
  * @brief  Handle ADD flag for Slave
  * @param  hi2c Pointer to a I2C_HandleTypeDef structure that contains
  *         the configuration information for I2C module
  * @param  IT2Flags Interrupt2 flags to handle.
  * @retval None
  */
static void I2C_Slave_ADDR(I2C_HandleTypeDef *hi2c, uint32_t IT2Flags)
{
    uint8_t TransferDirection = I2C_DIRECTION_RECEIVE;
    uint16_t SlaveAddrCode;

    if (((uint32_t)hi2c->State & (uint32_t)HAL_I2C_STATE_LISTEN) == (uint32_t)HAL_I2C_STATE_LISTEN)
    {
        /* Disable BUF interrupt, BUF enabling is manage through slave specific interface */
        __HAL_I2C_DISABLE_IT(hi2c, (I2C_IT_BUF));

        /* Transfer Direction requested by Master */
        if (I2C_CHECK_FLAG(IT2Flags, I2C_FLAG_TRA) == RESET)
        {
            TransferDirection = I2C_DIRECTION_TRANSMIT;
        }

//    if (I2C_CHECK_FLAG(IT2Flags, I2C_FLAG_DUALF) == RESET)
//    {
//      SlaveAddrCode = (uint16_t)hi2c->Init.OwnAddress1;
//    }
//    else
//    {
//      SlaveAddrCode = (uint16_t)hi2c->Init.OwnAddress2;
//    }

        /* Process Unlocked */
        __HAL_UNLOCK(hi2c);

        /* Call Slave Addr callback */
#if (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
        hi2c->AddrCallback(hi2c, TransferDirection, SlaveAddrCode);
#else
        HAL_I2C_AddrCallback(hi2c, TransferDirection, SlaveAddrCode);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
    }
    else
    {
        /* Clear ADDR flag */
        __HAL_I2C_CLEAR_FLAG(hi2c, I2C_FLAG_ADDR);

        /* Process Unlocked */
        __HAL_UNLOCK(hi2c);
    }
}

/**
  * @brief  Handle STOPF flag for Slave
  * @param  hi2c Pointer to a I2C_HandleTypeDef structure that contains
  *         the configuration information for I2C module
  * @retval None
  */
static void I2C_Slave_STOPF(I2C_HandleTypeDef *hi2c)
{
    /* Declaration of temporary variable to prevent undefined behavior of volatile usage */
    HAL_I2C_StateTypeDef CurrentState = hi2c->State;

    /* Disable EVT, BUF and ERR interrupt */
    __HAL_I2C_DISABLE_IT(hi2c, I2C_IT_EVT | I2C_IT_BUF | I2C_IT_ERR);

    /* Clear STOPF flag */
    __HAL_I2C_CLEAR_STOPFLAG(hi2c);

    /* Disable Acknowledge */
    CLEAR_BIT(hi2c->Instance->CR1, I2C_CR1_ACK);

    /* If a DMA is ongoing, Update handle size context */
    if ((hi2c->Instance->CR2 & I2C_CR2_DMAEN) == I2C_CR2_DMAEN)
    {
        if ((CurrentState == HAL_I2C_STATE_BUSY_RX) || (CurrentState == HAL_I2C_STATE_BUSY_RX_LISTEN))
        {
            hi2c->XferCount = (uint16_t)(__HAL_DMA_GET_COUNTER(hi2c->hdmarx));

            if (hi2c->XferCount != 0U)
            {
                /* Set ErrorCode corresponding to a Non-Acknowledge */
                hi2c->ErrorCode |= HAL_I2C_ERROR_AF;
            }

            /* Disable, stop the current DMA */
            CLEAR_BIT(hi2c->Instance->CR2, I2C_CR2_DMAEN);

            /* Abort DMA Xfer if any */
            if (HAL_DMA_GetState(hi2c->hdmarx) != HAL_DMA_STATE_READY)
            {
                /* Set the I2C DMA Abort callback :
                will lead to call HAL_I2C_ErrorCallback() at end of DMA abort procedure */
                hi2c->hdmarx->XferAbortCallback = I2C_DMAAbort;

