sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_i2c.c
                /* Abort DMA RX */
                if (HAL_DMA_Abort_IT(hi2c->hdmarx) != HAL_OK)
                {
                    /* Call Directly XferAbortCallback function in case of error */
                    hi2c->hdmarx->XferAbortCallback(hi2c->hdmarx);
                }
            }
        }
        else
        {
            hi2c->XferCount = (uint16_t)(__HAL_DMA_GET_COUNTER(hi2c->hdmatx));

            if (hi2c->XferCount != 0U)
            {
                /* Set ErrorCode corresponding to a Non-Acknowledge */
                hi2c->ErrorCode |= HAL_I2C_ERROR_AF;
            }

            /* Disable, stop the current DMA */
            CLEAR_BIT(hi2c->Instance->CR2, I2C_CR2_DMAEN);

            /* Abort DMA Xfer if any */
            if (HAL_DMA_GetState(hi2c->hdmatx) != HAL_DMA_STATE_READY)
            {
                /* Set the I2C DMA Abort callback :
                will lead to call HAL_I2C_ErrorCallback() at end of DMA abort procedure */
                hi2c->hdmatx->XferAbortCallback = I2C_DMAAbort;

                /* Abort DMA TX */
                if (HAL_DMA_Abort_IT(hi2c->hdmatx) != HAL_OK)
                {
                    /* Call Directly XferAbortCallback function in case of error */
                    hi2c->hdmatx->XferAbortCallback(hi2c->hdmatx);
                }
            }
        }
    }

    /* All data are not transferred, so set error code accordingly */
    if (hi2c->XferCount != 0U)
    {
        /* Store Last receive data if any */
        if (__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_BTF) == SET)
        {
            /* Read data from DR */
            *hi2c->pBuffPtr = (uint8_t)hi2c->Instance->DR;

            /* Increment Buffer pointer */
            hi2c->pBuffPtr++;

            /* Update counter */
            hi2c->XferCount--;
        }

        /* Store Last receive data if any */
        if (__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_RXNE) == SET)
        {
            /* Read data from DR */
            *hi2c->pBuffPtr = (uint8_t)hi2c->Instance->DR;

            /* Increment Buffer pointer */
            hi2c->pBuffPtr++;

            /* Update counter */
            hi2c->XferCount--;
        }

        if (hi2c->XferCount != 0U)
        {
            /* Set ErrorCode corresponding to a Non-Acknowledge */
            hi2c->ErrorCode |= HAL_I2C_ERROR_AF;
        }
    }

    if (hi2c->ErrorCode != HAL_I2C_ERROR_NONE)
    {
        /* Call the corresponding callback to inform upper layer of End of Transfer */
        I2C_ITError(hi2c);
    }
    else
    {
        if (CurrentState == HAL_I2C_STATE_BUSY_RX_LISTEN)
        {
            /* Set state at HAL_I2C_STATE_LISTEN */
            hi2c->PreviousState = I2C_STATE_NONE;
            hi2c->State = HAL_I2C_STATE_LISTEN;

            /* Call the corresponding callback to inform upper layer of End of Transfer */
#if (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
            hi2c->SlaveRxCpltCallback(hi2c);
#else
            HAL_I2C_SlaveRxCpltCallback(hi2c);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
        }

        if (hi2c->State == HAL_I2C_STATE_LISTEN)
        {
            hi2c->XferOptions = I2C_NO_OPTION_FRAME;
            hi2c->PreviousState = I2C_STATE_NONE;
            hi2c->State = HAL_I2C_STATE_READY;
            hi2c->Mode = HAL_I2C_MODE_NONE;

            /* Call the Listen Complete callback, to inform upper layer of the end of Listen usecase */
#if (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
            hi2c->ListenCpltCallback(hi2c);
#else
            HAL_I2C_ListenCpltCallback(hi2c);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
        }
        else
        {
            if ((hi2c->PreviousState  == I2C_STATE_SLAVE_BUSY_RX) || (CurrentState == HAL_I2C_STATE_BUSY_RX))
            {
                hi2c->PreviousState = I2C_STATE_NONE;
                hi2c->State = HAL_I2C_STATE_READY;
                hi2c->Mode = HAL_I2C_MODE_NONE;

#if (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
                hi2c->SlaveRxCpltCallback(hi2c);
#else
                HAL_I2C_SlaveRxCpltCallback(hi2c);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
            }
        }
    }
}

/**
  * @param  hi2c Pointer to a I2C_HandleTypeDef structure that contains
  *         the configuration information for I2C module
  * @retval None
  */
static void I2C_Slave_AF(I2C_HandleTypeDef *hi2c)
{
    /* Declaration of temporary variables to prevent undefined behavior of volatile usage */
    HAL_I2C_StateTypeDef CurrentState = hi2c->State;
    uint32_t CurrentXferOptions       = hi2c->XferOptions;

    if (((CurrentXferOptions ==  I2C_FIRST_AND_LAST_FRAME) || (CurrentXferOptions == I2C_LAST_FRAME)) && \
            (CurrentState == HAL_I2C_STATE_LISTEN))
    {
        hi2c->XferOptions = I2C_NO_OPTION_FRAME;

        /* Disable EVT, BUF and ERR interrupt */
        __HAL_I2C_DISABLE_IT(hi2c, I2C_IT_EVT | I2C_IT_BUF | I2C_IT_ERR);

        /* Clear AF flag */
        __HAL_I2C_CLEAR_FLAG(hi2c, I2C_FLAG_AF);

        /* Disable Acknowledge */
        CLEAR_BIT(hi2c->Instance->CR1, I2C_CR1_ACK);

        hi2c->PreviousState = I2C_STATE_NONE;
        hi2c->State         = HAL_I2C_STATE_READY;
        hi2c->Mode          = HAL_I2C_MODE_NONE;

        /* Call the Listen Complete callback, to inform upper layer of the end of Listen usecase */
#if (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
        hi2c->ListenCpltCallback(hi2c);
#else
        HAL_I2C_ListenCpltCallback(hi2c);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
    }
    else if (CurrentState == HAL_I2C_STATE_BUSY_TX)
    {
        hi2c->XferOptions   = I2C_NO_OPTION_FRAME;
        hi2c->PreviousState = I2C_STATE_SLAVE_BUSY_TX;
        hi2c->State         = HAL_I2C_STATE_READY;
        hi2c->Mode          = HAL_I2C_MODE_NONE;

        /* Disable EVT, BUF and ERR interrupt */
        __HAL_I2C_DISABLE_IT(hi2c, I2C_IT_EVT | I2C_IT_BUF | I2C_IT_ERR);

        /* Clear AF flag */
        __HAL_I2C_CLEAR_FLAG(hi2c, I2C_FLAG_AF);

        /* Disable Acknowledge */
        CLEAR_BIT(hi2c->Instance->CR1, I2C_CR1_ACK);

#if (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
        hi2c->SlaveTxCpltCallback(hi2c);
#else
        HAL_I2C_SlaveTxCpltCallback(hi2c);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
    }
    else
    {
        /* Clear AF flag only */
        /* State Listen, but XferOptions == FIRST or NEXT */
        __HAL_I2C_CLEAR_FLAG(hi2c, I2C_FLAG_AF);
    }
}

/**
  * @brief  I2C interrupts error process
  * @param  hi2c I2C handle.
  * @retval None
  */
static void I2C_ITError(I2C_HandleTypeDef *hi2c)
{
    /* Declaration of temporary variable to prevent undefined behavior of volatile usage */
    HAL_I2C_StateTypeDef CurrentState = hi2c->State;

    if ((hi2c->Mode == HAL_I2C_MODE_MASTER) && (CurrentState == HAL_I2C_STATE_BUSY_RX))
    {
        /* Disable Pos bit in I2C CR1 when error occurred in Master/Mem Receive IT Process */
        hi2c->Instance->CR1 &= ~I2C_CR1_POS;
    }

    if (((uint32_t)CurrentState & (uint32_t)HAL_I2C_STATE_LISTEN) == (uint32_t)HAL_I2C_STATE_LISTEN)
    {
        /* keep HAL_I2C_STATE_LISTEN */
        hi2c->PreviousState = I2C_STATE_NONE;
        hi2c->State = HAL_I2C_STATE_LISTEN;
    }
    else
    {
        /* If state is an abort treatment on going, don't change state */
        /* This change will be do later */
        if ((READ_BIT(hi2c->Instance->CR2, I2C_CR2_DMAEN) != I2C_CR2_DMAEN) && (CurrentState != HAL_I2C_STATE_ABORT))
        {
            hi2c->State = HAL_I2C_STATE_READY;
        }
        hi2c->PreviousState = I2C_STATE_NONE;
        hi2c->Mode = HAL_I2C_MODE_NONE;
    }

    /* Abort DMA transfer */
    if (READ_BIT(hi2c->Instance->CR2, I2C_CR2_DMAEN) == I2C_CR2_DMAEN)
    {
        hi2c->Instance->CR2 &= ~I2C_CR2_DMAEN;

        if (hi2c->hdmatx->State != HAL_DMA_STATE_READY)
        {
            /* Set the DMA Abort callback :
            will lead to call HAL_I2C_ErrorCallback() at end of DMA abort procedure */
            hi2c->hdmatx->XferAbortCallback = I2C_DMAAbort;

