sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_i2c.c
            if (HAL_DMA_Abort_IT(hi2c->hdmatx) != HAL_OK)
            {
                /* Disable I2C peripheral to prevent dummy data in buffer */
                __HAL_I2C_DISABLE(hi2c);

                hi2c->State = HAL_I2C_STATE_READY;

                /* Call Directly XferAbortCallback function in case of error */
                hi2c->hdmatx->XferAbortCallback(hi2c->hdmatx);
            }
        }
        else
        {
            /* Set the DMA Abort callback :
            will lead to call HAL_I2C_ErrorCallback() at end of DMA abort procedure */
            hi2c->hdmarx->XferAbortCallback = I2C_DMAAbort;

            if (HAL_DMA_Abort_IT(hi2c->hdmarx) != HAL_OK)
            {
                /* Store Last receive data if any */
                if (__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_RXNE) == SET)
                {
                    /* Read data from DR */
                    *hi2c->pBuffPtr = (uint8_t)hi2c->Instance->DR;

                    /* Increment Buffer pointer */
                    hi2c->pBuffPtr++;
                }

                /* Disable I2C peripheral to prevent dummy data in buffer */
                __HAL_I2C_DISABLE(hi2c);

                hi2c->State = HAL_I2C_STATE_READY;

                /* Call Directly hi2c->hdmarx->XferAbortCallback function in case of error */
                hi2c->hdmarx->XferAbortCallback(hi2c->hdmarx);
            }
        }
    }
    else if (hi2c->State == HAL_I2C_STATE_ABORT)
    {
        hi2c->State = HAL_I2C_STATE_READY;
        hi2c->ErrorCode = HAL_I2C_ERROR_NONE;

        /* Store Last receive data if any */
        if (__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_RXNE) == SET)
        {
            /* Read data from DR */
            *hi2c->pBuffPtr = (uint8_t)hi2c->Instance->DR;

            /* Increment Buffer pointer */
            hi2c->pBuffPtr++;
        }

        /* Disable I2C peripheral to prevent dummy data in buffer */
        __HAL_I2C_DISABLE(hi2c);

        /* Call the corresponding callback to inform upper layer of End of Transfer */
#if (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
        hi2c->AbortCpltCallback(hi2c);
#else
        HAL_I2C_AbortCpltCallback(hi2c);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
    }
    else
    {
        /* Store Last receive data if any */
        if (__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_RXNE) == SET)
        {
            /* Read data from DR */
            *hi2c->pBuffPtr = (uint8_t)hi2c->Instance->DR;

            /* Increment Buffer pointer */
            hi2c->pBuffPtr++;
        }

        /* Call user error callback */
#if (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
        hi2c->ErrorCallback(hi2c);
#else
        HAL_I2C_ErrorCallback(hi2c);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
    }
    /* STOP Flag is not set after a NACK reception */
    /* So may inform upper layer that listen phase is stopped */
    /* during NACK error treatment */
    CurrentState = hi2c->State;
    if (((hi2c->ErrorCode & HAL_I2C_ERROR_AF) == HAL_I2C_ERROR_AF) && (CurrentState == HAL_I2C_STATE_LISTEN))
    {
        /* Disable EVT, BUF and ERR interrupt */
        __HAL_I2C_DISABLE_IT(hi2c, I2C_IT_EVT | I2C_IT_BUF | I2C_IT_ERR);

        hi2c->XferOptions   = I2C_NO_OPTION_FRAME;
        hi2c->PreviousState = I2C_STATE_NONE;
        hi2c->State         = HAL_I2C_STATE_READY;
        hi2c->Mode          = HAL_I2C_MODE_NONE;

        /* Call the Listen Complete callback, to inform upper layer of the end of Listen usecase */
#if (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
        hi2c->ListenCpltCallback(hi2c);
#else
        HAL_I2C_ListenCpltCallback(hi2c);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
    }
}

/**
  * @param  hi2c Pointer to a I2C_HandleTypeDef structure that contains
  *         the configuration information for I2C module
  * @param  DevAddress Target device address: The device 7 bits address value
  *         in datasheet must be shifted to the left before calling the interface
  * @param  Timeout Timeout duration
  * @param  Tickstart Tick start value
  * @retval HAL status
  */
static HAL_StatusTypeDef I2C_MasterRequestWrite(I2C_HandleTypeDef *hi2c, uint16_t DevAddress, uint32_t Timeout, uint32_t Tickstart)
{
    /* Declaration of temporary variable to prevent undefined behavior of volatile usage */
    uint32_t CurrentXferOptions = hi2c->XferOptions;

    /* Generate Start condition if first transfer */
    if ((CurrentXferOptions == I2C_FIRST_AND_LAST_FRAME) || (CurrentXferOptions == I2C_FIRST_FRAME) || (CurrentXferOptions == I2C_NO_OPTION_FRAME))
    {
        /* Generate Start */
        SET_BIT(hi2c->Instance->CR1, I2C_CR1_START);
    }
    else if (hi2c->PreviousState == I2C_STATE_MASTER_BUSY_RX)
    {
        /* Generate ReStart */
        SET_BIT(hi2c->Instance->CR1, I2C_CR1_START);
    }
    else
    {
        /* Do nothing */
    }

    /* Wait until SB flag is set */
    if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_SB, RESET, Timeout, Tickstart) != HAL_OK)
    {
        return HAL_ERROR;
    }

    /* Send slave address */
    hi2c->Instance->DR = I2C_7BIT_ADD_WRITE(DevAddress);

    /* Wait until ADDR flag is set */
    if (I2C_WaitOnMasterAddressFlagUntilTimeout(hi2c, I2C_FLAG_ADDR, Timeout, Tickstart) != HAL_OK)
    {
        return HAL_ERROR;
    }

    return HAL_OK;
}

/**
  * @brief  Master sends target device address for read request.
  * @param  hi2c Pointer to a I2C_HandleTypeDef structure that contains
  *         the configuration information for I2C module
  * @param  DevAddress Target device address: The device 7 bits address value
  *         in datasheet must be shifted to the left before calling the interface
  * @param  Timeout Timeout duration
  * @param  Tickstart Tick start value
  * @retval HAL status
  */
static HAL_StatusTypeDef I2C_MasterRequestRead(I2C_HandleTypeDef *hi2c, uint16_t DevAddress, uint32_t Timeout, uint32_t Tickstart)
{
    /* Declaration of temporary variable to prevent undefined behavior of volatile usage */
    uint32_t CurrentXferOptions = hi2c->XferOptions;

    /* Enable Acknowledge */
    SET_BIT(hi2c->Instance->CR1, I2C_CR1_ACK);

    /* Generate Start condition if first transfer */
    if ((CurrentXferOptions == I2C_FIRST_AND_LAST_FRAME) || (CurrentXferOptions == I2C_FIRST_FRAME)  || (CurrentXferOptions == I2C_NO_OPTION_FRAME))
    {
        /* Generate Start */
        SET_BIT(hi2c->Instance->CR1, I2C_CR1_START);
    }
    else if (hi2c->PreviousState == I2C_STATE_MASTER_BUSY_TX)
    {
        /* Generate ReStart */
        SET_BIT(hi2c->Instance->CR1, I2C_CR1_START);
    }
    else
    {
        /* Do nothing */
    }

    /* Wait until SB flag is set */
    if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_SB, RESET, Timeout, Tickstart) != HAL_OK)
    {
        return HAL_ERROR;
    }


