sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_i2c.c
    /* Send slave address */
    hi2c->Instance->DR = I2C_7BIT_ADD_READ(DevAddress);

    /* Wait until ADDR flag is set */
    if (I2C_WaitOnMasterAddressFlagUntilTimeout(hi2c, I2C_FLAG_ADDR, Timeout, Tickstart) != HAL_OK)
    {
        return HAL_ERROR;
    }

    return HAL_OK;
}

/**
  * @brief  DMA I2C process complete callback.
  * @param  hdma DMA handle
  * @retval None
  */
static void I2C_DMAXferCplt(DMA_HandleTypeDef *hdma)
{
    I2C_HandleTypeDef *hi2c = (I2C_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent; /* Derogation MISRAC2012-Rule-11.5 */

    /* Declaration of temporary variable to prevent undefined behavior of volatile usage */
    HAL_I2C_StateTypeDef CurrentState = hi2c->State;
    HAL_I2C_ModeTypeDef CurrentMode   = hi2c->Mode;
    uint32_t CurrentXferOptions       = hi2c->XferOptions;

    /* Disable EVT and ERR interrupt */
    __HAL_I2C_DISABLE_IT(hi2c, I2C_IT_EVT | I2C_IT_ERR);

    /* Clear Complete callback */
    hi2c->hdmatx->XferCpltCallback = NULL;
    hi2c->hdmarx->XferCpltCallback = NULL;

    if ((((uint32_t)CurrentState & (uint32_t)HAL_I2C_STATE_BUSY_TX) == (uint32_t)HAL_I2C_STATE_BUSY_TX) || ((((uint32_t)CurrentState & (uint32_t)HAL_I2C_STATE_BUSY_RX) == (uint32_t)HAL_I2C_STATE_BUSY_RX) && (CurrentMode == HAL_I2C_MODE_SLAVE)))
    {
        /* Disable DMA Request */
        CLEAR_BIT(hi2c->Instance->CR2, I2C_CR2_DMAEN);

        hi2c->XferCount = 0U;

        if (CurrentState == HAL_I2C_STATE_BUSY_TX_LISTEN)
        {
            /* Set state at HAL_I2C_STATE_LISTEN */
            hi2c->PreviousState = I2C_STATE_SLAVE_BUSY_TX;
            hi2c->State = HAL_I2C_STATE_LISTEN;

            /* Call the corresponding callback to inform upper layer of End of Transfer */
#if (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
            hi2c->SlaveTxCpltCallback(hi2c);
#else
            HAL_I2C_SlaveTxCpltCallback(hi2c);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
        }
        else if (CurrentState == HAL_I2C_STATE_BUSY_RX_LISTEN)
        {
            /* Set state at HAL_I2C_STATE_LISTEN */
            hi2c->PreviousState = I2C_STATE_SLAVE_BUSY_RX;
            hi2c->State = HAL_I2C_STATE_LISTEN;

            /* Call the corresponding callback to inform upper layer of End of Transfer */
#if (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
            hi2c->SlaveRxCpltCallback(hi2c);
#else
            HAL_I2C_SlaveRxCpltCallback(hi2c);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
        }
        else
        {
            /* Do nothing */
        }

        /* Enable EVT and ERR interrupt to treat end of transfer in IRQ handler */
        __HAL_I2C_ENABLE_IT(hi2c, I2C_IT_EVT | I2C_IT_ERR);
    }
    /* Check current Mode, in case of treatment DMA handler have been preempted by a prior interrupt */
    else if (hi2c->Mode != HAL_I2C_MODE_NONE)
    {
        if (hi2c->XferCount == (uint16_t)1)
        {
            /* Disable Acknowledge */
            CLEAR_BIT(hi2c->Instance->CR1, I2C_CR1_ACK);
        }

        /* Disable EVT and ERR interrupt */
        __HAL_I2C_DISABLE_IT(hi2c, I2C_IT_EVT | I2C_IT_ERR);

        /* Prepare next transfer or stop current transfer */
        if ((CurrentXferOptions == I2C_NO_OPTION_FRAME) || (CurrentXferOptions == I2C_FIRST_AND_LAST_FRAME) || (CurrentXferOptions == I2C_OTHER_AND_LAST_FRAME) || (CurrentXferOptions == I2C_LAST_FRAME))
        {
            /* Generate Stop */
            SET_BIT(hi2c->Instance->CR1, I2C_CR1_STOP);
        }

        /* Disable Last DMA */
        CLEAR_BIT(hi2c->Instance->CR2, I2C_CR2_LAST);

        /* Disable DMA Request */
        CLEAR_BIT(hi2c->Instance->CR2, I2C_CR2_DMAEN);

        hi2c->XferCount = 0U;

        /* Check if Errors has been detected during transfer */
        if (hi2c->ErrorCode != HAL_I2C_ERROR_NONE)
        {
#if (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
            hi2c->ErrorCallback(hi2c);
#else
            HAL_I2C_ErrorCallback(hi2c);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
        }
        else
        {
            hi2c->State = HAL_I2C_STATE_READY;

            if (hi2c->Mode == HAL_I2C_MODE_MEM)
            {
                hi2c->Mode = HAL_I2C_MODE_NONE;
                hi2c->PreviousState = I2C_STATE_NONE;

#if (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
                hi2c->MemRxCpltCallback(hi2c);
#else
                HAL_I2C_MemRxCpltCallback(hi2c);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
            }
            else
            {
                hi2c->Mode = HAL_I2C_MODE_NONE;
                hi2c->PreviousState = I2C_STATE_MASTER_BUSY_RX;

#if (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
                hi2c->MasterRxCpltCallback(hi2c);
#else
                HAL_I2C_MasterRxCpltCallback(hi2c);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
            }
        }
    }
    else
    {
        /* Do nothing */
    }
}

/**
  * @brief  DMA I2C communication error callback.
  * @param  hdma DMA handle
  * @retval None
  */
static void I2C_DMAError(DMA_HandleTypeDef *hdma)
{
    I2C_HandleTypeDef *hi2c = (I2C_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent; /* Derogation MISRAC2012-Rule-11.5 */

    /* Clear Complete callback */
    hi2c->hdmatx->XferCpltCallback = NULL;
    hi2c->hdmarx->XferCpltCallback = NULL;

    /* Disable Acknowledge */
    CLEAR_BIT(hi2c->Instance->CR1, I2C_CR1_ACK);

    hi2c->XferCount       = 0U;
    hi2c->State           = HAL_I2C_STATE_READY;
    hi2c->Mode            = HAL_I2C_MODE_NONE;
    hi2c->ErrorCode       |= HAL_I2C_ERROR_DMA;

#if (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
    hi2c->ErrorCallback(hi2c);
#else
    HAL_I2C_ErrorCallback(hi2c);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
}

/**
  * @brief DMA I2C communication abort callback
  *        (To be called at end of DMA Abort procedure).
  * @param hdma DMA handle.
  * @retval None
  */
static void I2C_DMAAbort(DMA_HandleTypeDef *hdma)
{
    I2C_HandleTypeDef *hi2c = (I2C_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent; /* Derogation MISRAC2012-Rule-11.5 */

    /* Declaration of temporary variable to prevent undefined behavior of volatile usage */
    HAL_I2C_StateTypeDef CurrentState = hi2c->State;

    /* Clear Complete callback */
    hi2c->hdmatx->XferCpltCallback = NULL;
    hi2c->hdmarx->XferCpltCallback = NULL;

    /* Disable Acknowledge */
    CLEAR_BIT(hi2c->Instance->CR1, I2C_CR1_ACK);

    hi2c->XferCount = 0U;

